{"Quotes":[{"quote":"In the end, we're all dead men. Sadly, we cannot choose how, or when. But what we can choose is how we decide to meet that end, so we are remembered forever as men.", "author":"Gladiator"},
{"quote":"Beware that beast called Comfort. He'll never hurt you, but he'll also never, ever help you to your goals. Anything worth doing doing in this world will not be easy.", "author":"Carlos Xuma"},
{"quote":"Watch your thoughts; they become words. Watch your words; they become actions. Watch your actions; they become habit. Watch your habits; they become character. Watch your character; it becomes your destiny.", "author":"Lao Tzu"},
{"quote":"Our minds become a cumulation of all the data we consume.", "author":"Ash Blankenship"},
{"quote":"What you do is more important than how you do everything else, and doing something well does not make it important.", "author":"Timothy Ferris"},
{"quote":"A remarkable, glorious achievement is just what a long series of unremarkable, unglorious tasks looks like from far away.", "author":"Unknown"},
{"quote":"It's what you practice in private that you will be rewarded for in public.", "author":"Tony Robbins"},
{"quote":"No single event can awaken within us a stranger totally unknown to us. To live is to be slowly born.", "author":"Antoine de Saint-Exupery"},
{"quote":"The meaning of things lies not in the things themselves, but in our attitude towards them.", "author":"Antoine de Saint-Exupery"},
{"quote":"Perfection is finally attained not when there is no longer anything to add but when there is no longer anything to take away, when a body has been stripped down to its nakedness.", "author":"Antoine de Saint-Exupery"},
{"quote":"Transport of the mails, transport of the human voice, transport of flickering pictures-in this century as in others our highest accomplishments still have the single aim of bringing men together.", "author":"Antoine de Saint-Exupery"},
{"quote":"Love does not consist in gazing at each other, but in looking outward together in the same direction.", "author":"Antoine de Saint-Exupery"},
{"quote":"When you give yourself, you receive more than you give.", "author":"Antoine de Saint-Exupery"},
{"quote":"The time for action is now. It's never too late to do something.", "author":"Antoine de Saint-Exupery"},
{"quote":"It is only with the heart that one can see rightly; what is essential is invisible to the eye.", "author":"Antoine de Saint-Exupery"},
{"quote":"I know but one freedom, and that is the freedom of the mind.", "author":"Antoine de Saint-Exupery"},
{"quote":"Each man must look to himself to teach him the meaning of life. It is not something discovered: it is something molded.", "author":"Antoine de Saint-Exupery"},
{"quote":"The 'true man' does not fear death because he returns the energy as he received it, pure and uncontaminated by desires or anxieties: The True Man did not forget where he began; he did not try to find out where he would end. He received something and took pleasure in it; he forgot about it and handed it back again.", "author":"Chang-Tzu"},
{"quote":"If you're willing to restrict the flexibility of your approach, you can almost always do something better.", "author":"John Carmack"},
{"quote":"There is no honor in the accumulation of knowledge without the intention of it's application.", "author":"Tirth Patel"},
{"quote":"As my rich dad often said, 'I can always make another dollar, but I cannot make another day.'", "author":"Robert Kiyosaki"},
{"quote":"I did something that made people present their best selves to me wherever I go.", "author":"Jim Carrey"},
{"quote":"Look at a stone cutter hammering away at his rock, perhaps a hundred times without as much as a crack showing in it. Yet at the hundred-and-first blow it will split in two, and I know it was not the last blow that did it, but all that had gone before.", "author":"Jacob Riis"},
{"quote":"True humility is not thinking less of yourself; it is thinking of yourself less.", "author":"C.S. Lewis"},
{"quote":"Our chief want is someone who will inspire us to be what we know we could be.", "author":"Ralph Waldo Emerson"},
{"quote":"Manners maketh man.", "author":"Harry Hart"},
{"quote":"To be yourself in a world that is constantly trying to make you something else is the greatest accomplishment.", "author":"Ralph Waldo Emerson"},
{"quote":"Our deepest fear is not that we are inadequate. Our deepest fear is that we are powerful beyond measure.", "author":"Marianne Williamson"},
{"quote":"Sow a thought, reap an action; Sow an action, reap a habit; Sow a habit, reap a character; Sow a character, reap a destiny.", "author":"Unknown"},
{"quote":"How you Show up in the World - Will determine your Level of Success.", "author":"Maurice DiMino"},
{"quote":"We've heard that a million monkeys at a million keyboards could produce the complete works of Shakespeare; now, thanks to the Internet, we know that is not true.", "author":"Robert Wilenski"},
{"quote":"I am not young enough to know everything.", "author":"Oscar Wild"},
{"quote":"Consistency is the last refuge of the unimaginative.", "author":"Oscar Wild"},
{"quote":"If you want to tell people the truth, make them laugh, otherwise they'll kill you.", "author":"Oscar Wild"},
{"quote":"Whenever people agree with me I always feel I must be wrong.", "author":"Oscar Wild"},
{"quote":"When the gods wish to punish us, they answer our prayers.", "author":"Oscar Wild"},
{"quote":"I can resist anything but temptation.", "author":"Oscar Wild"},
{"quote":"Experience is the name everyone gives to their mistakes.", "author":"Oscar Wild"},
{"quote":"The public is wonderfully tolerant. It forgives everything except genius.", "author":"Oscar Wild"},
{"quote":"The nice part about being a pessimist is that you are constantly being either proven right or pleasantly surprised.", "author":"George F. Will"},
{"quote":"The world is wide, and I will not waste my life in friction when it could be turned into momentum.", "author":"Francess Willard"},
{"quote":"We learn from experience. A man never wakes up his second baby just to see it smile.", "author":"Grace Williams"},
{"quote":"Gossip is when you hear something you like about someone you don't.", "author":"Earl Wilson"},
{"quote":"Courage is the art of being the only one who knows you're scared to death.", "author":"Harold Wilson"},
{"quote":"It only takes 20 years for a liberal to become a conservative without changing a single idea.", "author":"Robert Anton Wilson"},
{"quote":"If not actually disgruntled, he was far from being gruntled.", "author":"P. G. Wodehouse"},
{"quote":"A cult is a religion with no political power.", "author":"Tom Wolfe"},
{"quote":"It's not so important who starts the game but who finishes it.", "author":"John Wooden"},
{"quote":"TV is chewing gum for the eyes.", "author":"Frank Lloyd Wright"},
{"quote":"The truth is more important than the facts.", "author":"Frank Lloyd Wright"},
{"quote":"Everywhere is walking distance if you have the time.", "author":"Steven Wright"},
{"quote":"It doesn't make a difference what temperature a room is, it's always room temperature.", "author":"Steven Wright"},
{"quote":"You can't have everything. Where would you put it?", "author":"Steven Wright"},
{"quote":"The trouble with weather forecasting is that it's right too often for us to ignore it and wrong too often for us to rely on it.", "author":"Patrick Young"},
{"quote":"The truth is that there is nothing noble in being superior to somebody else.The only real nobility is in being superior to your former self.", "author":"WhitneyYoung"},
{"quote":"An incompetent attorney can delay a trial for months or years. A competent attorney can delay one even longer.", "author":"Evelle J. Younger"},
{"quote":"I once wanted to become an atheist, but I gave up - they have no holidays.", "author":"Henny Youngman"},
{"quote":"I take my wife everywhere, but she keeps finding her way back.", "author":"Henny Youngman"},
{"quote":"I told the doctor I broke my leg in two places. He told me to quit going to those places.", "author":"Henny Youngman"},
{"quote":"My Grandmother is over eighty and still doesn't need glasses. Drinks right out of the bottle.", "author":"Henny Youngman"},
{"quote":"When I read about the evils of drinking, I gave up reading.", "author":"Henny Youngman"},
{"quote":"It is better to die on your feet than live on your knees.", "author":"Emiliano Zapata"},
{"quote":"Art is making something out of nothing and selling it.", "author":"Frank Zappa"},
{"quote":"I think it is good that books still exist, but they do make me sleepy.", "author":"Frank Zappa"},
{"quote":"There are too many people, and too few human beings.", "author":"Robert Zend"},
{"quote":"The reason we have two ears and only one mouth, is that we may hear more and speak less.", "author":"Zeno"},
{"quote":"Quit now, you'll never make it. If you disregard this advice, you'll be halfway there.", "author":"David Zucker"},
{"quote":"A room without books is like a body without a soul. ", "author":"Marcus Tullius Cicero"},
{"quote":"Be the change that you wish to see in the world.", "author":" Mahatma Gandhi"},
{"quote":"If you tell the truth, you don't have to remember anything. ", "author":"Mark Twain"},
{"quote":"If you want to know what a man's like, take a good look at how he treats his inferiors, not his equals.", "author":" J.K. Rowling"},
{"quote":"To live is the rarest thing in the world. Most people exist, that is all.", "author":" Oscar Wilde"},
{"quote":"Without music, life would be a mistake.", "author":" Friedrich Nietzsche"},
{"quote":"Always forgive your enemies, nothing annoys them so much. ", "author":"Oscar Wilde"},
{"quote":"Life isn't about getting and having, it's about giving and being.", "author":"Kevin Kruse"},
{"quote":"Whatever the mind of man can conceive and believe, it can achieve.", "author":"Napoleon Hill"},
{"quote":"Strive not to be a success, but rather to be of value.", "author":"Albert Einstein"}, 
{"quote":"Perfection is attained by slow degrees, it requires the hand of time.", "author":"Voltaire"},
{"quote":"Don't cry because it's over, smile because it happened.", "author":"Dr. Seuss" },
{"quote":"Be yourself, everyone else is already taken.", "author":"Oscar Wilde" },
{"quote":"Two things are infinite: the universe and human stupidity, and I'm not sure about the universe.", "author":"Albert Einstein" },
{"quote":"You only live once, but if you do it right, once is enough.", "author":"Mae West" },
{"quote":"Be the change that you wish to see in the world.", "author":"Mahatma Gandhi" },
{"quote":"If you want to know what a man's like, take a good look at how he treats his inferiors, not his equals.", "author":"J.K.Rowling" },
{"quote":"No one can make you feel inferior without your consent.", "author":"Eleanor Roosevelt"},
{"quote":"Always forgive your enemies, nothing annoys them so much.", "author":"Oscar Wilde"},
{"quote":"Learn what is true in order to do what is right.", "author": "Thomas Huxley"},
{"quote":"Three things cannot be long hidden: the sun, the moon, and the truth.", "author": "Buddha"},
{"quote":"Everything we hear is an opinion, not a fact. Everything we see is a perspective, not the truth.", "author": "Marcus Aurelius"},
{"quote":"Some people think that the truth can be hidden with a little cover-up and decoration. But as time goes by, what is true is revealed, and what is fake fades away.", "author": "Ismail Haniyeh"},
{"quote":"Tell me I'm clever, Tell me I'm kind, Tell me I'm talented, Tell me I'm cute, Tell me I'm sensitive, Graceful and wise, Tell me I'm perfect - But tell me the truth.", "author": "Shel Silverstein"},
{"quote":"Honesty is the first chapter in the book of wisdom.", "author": "Thomas Jefferson"},
{"quote":"In matters of truth and justice, there is no difference between large and small problems, for issues concerning the treatment of people are all the same.", "author": "Albert Einstein"},
{"quote":"I'm for truth, no matter who tells it. I'm for justice, no matter who it's for or against.", "author": "Malcolm X"},
{"quote":"The truth is incontrovertible. Malice may attack it, ignorance may deride it, but in the end, there it is.", "author": "Winston Churchill"},
{"quote":"There are only two mistakes one can make along the road to truth; not going all the way, and not starting.", "author": "Buddha"},
{"quote":"The stupid believe that to be truthful is easy; only the artist, the great artist, knows how difficult it is.", "author": "Willa Cather"},
{"quote":"If you tell the truth, you don't have to remember anything.", "author": "Mark Twain"},
{"quote":"All truths are easy to understand once they are discovered; the point is to discover them.", "author": "Galileo Galilei"},
{"quote":"On the mountains of truth you can never climb in vain: either you will reach a point higher up today, or you will be training your powers so that you will be able to climb higher tomorrow.", "author": "Friedrich Nietzsche"},
{"quote":"I believe that it is better to tell the truth than a lie. I believe it is better to be free than to be a slave. And I believe it is better to know than to be ignorant.", "author": "H. L. Mencken"},
{"quote":"In a time of universal deceit - telling the truth is a revolutionary act.", "author": "George Orwell"},
{"quote":"Only enemies speak the truth; friends and lovers lie endlessly, caught in the web of duty.", "author": "Stephen King"},
{"quote":"Man is least himself when he talks in his own person. Give him a mask, and he will tell you the truth.", "author": "Oscar Wilde"},
{"quote":"The water in a vessel is sparkling; the water in the sea is dark. The small truth has words which are clear; the great truth has great silence.", "author": "Rabindranath Tagore"},
{"quote":"The truth will set you free, but first it will make you miserable.", "author": "James A. Garfield"},
{"quote":"By doubting we are led to question, by questioning we arrive at the truth.", "author": "Peter Abelard"},
{"quote":"I am the Way, the Truth, and the Life. No one comes to the Father except through me.", "author": "Jesus Christ"},
{"quote":"Truth is like the sun. You can shut it out for a time, but it ain't goin' away.", "author": "Elvis Presley"},
{"quote":"It's no wonder that truth is stranger than fiction. Fiction has to make sense.", "author": "Mark Twain"},
{"quote":"Our duty is to encourage every one in his struggle to live up to his own highest idea, and strive at the same time to make the ideal as near as possible to the Truth.", "author": "Swami Vivekananda"},
{"quote":"Words are but symbols for the relations of things to one another and to us; nowhere do they touch upon absolute truth.", "author": "Friedrich Nietzsche"},
{"quote":"When I grew up, in Taiwan, the Korean War was seen as a good war, where America protected Asia. It was sort of an extension of World War II. And it was, of course, the peak of the Cold War. People in Taiwan were generally proAmerican. The Korean War made Japan. And then the Vietnam War made Taiwan. There is some truth to that.", "author": "Ang Lee"},
{"quote":"Truth is powerful and it prevails.", "author": "Sojourner Truth"},
{"quote":"Love is the only reality and it is not a mere sentiment. It is the ultimate truth that lies at the heart of creation.", "author": "Rabindranath Tagore"},
{"quote":"A scientific truth does not triumph by convincing its opponents and making them see the light, but rather because its opponents eventually die and a new generation grows up that is familiar with it.", "author": "Max Planck"},
{"quote":"Seek not greatness, but seek truth and you will find both.", "author": "Horace Mann"},
{"quote":"You don't have to be scared of me, because I am loyal. Why are people so scared of creative ideas and so scared of truth? All I want to do is do good.", "author": "Kanye West"},
{"quote":"Morality is the basis of things and truth is the substance of all morality.", "author": "Mahatma Gandhi"},
{"quote":"Unemployment is sky-rocketing; deflation is in our future for the first time since the Great Depression. I don't care whose fault it is, it's the truth.", "author": "John Mellencamp"},
{"quote":"People like to say that the conflict is between good and evil. The real conflict is between truth and lies.", "author": "Miguel Angel Ruiz"},
{"quote":"It is a truth universally acknowledged, that a single man in possession of a good fortune, must be in want of a wife.", "author": "Jane Austen"},
{"quote":"Don't let your special character and values, the secret that you know and no one else does, the truth - don't let that get swallowed up by the great chewing complacency.", "author": "Aesop"},
{"quote":"The truth is of course is that there is no journey. We are arriving and departing all at the same time.", "author": "David Bowie"},
{"quote":"The truth is that all men having power ought to be mistrusted.", "author": "James Madison"},
{"quote":"When you find your definitions in God, you find the very purpose for which you were created. Put your hand into God's hand, know His absolutes, demonstrate His love, present His truth, and the message of redemption and transformation will take hold.", "author": "Ravi Zacharias"},
{"quote":"He who knows nothing is closer to the truth than he whose mind is filled with falsehoods and errors.", "author": "Thomas Jefferson"},
{"quote":"I was like a boy playing on the sea-shore, and diverting myself now and then finding a smoother pebble or a prettier shell than ordinary, whilst the great ocean of truth lay all undiscovered before me.", "author": "Isaac Newton"},
{"quote":"Technology has advanced more in the last thirty years than in the previous two thousand. The exponential increase in advancement will only continue. Anthropological Commentary The opposite of a trivial truth is false; the opposite of a great truth is also true.", "author": "Niels Bohr"},
{"quote":"We should consider every day lost on which we have not danced at least once. And we should call every truth false which was not accompanied by at least one laugh.", "author": "Friedrich Nietzsche"},
{"quote":"He who seeks truth shall find beauty. He who seeks beauty shall find vanity. He who seeks order shall find gratification. He who seeks gratification shall be disappointed. He who considers himself the servant of his fellow beings shall find the joy of self-expression. He who seeks self-expression shall fall into the pit of arrogance.", "author": "Moshe Safdie"},
{"quote":"I've studied pathological liars, and anything they say, they believe, and that's one of the reasons they're so convincing, because they have no connection with the truth. It's a dead issue. It's like they're color-blind to the truth. So anything that comes out of their mouths is their reality.", "author": "Jane Velez-Mitchell"},
{"quote":"A liar begins with making falsehood appear like truth, and ends with making truth itself appear like falsehood.", "author": "William Shenstone"},
{"quote":"The truth is not for all men, but only for those who seek it.", "author": "Ayn Rand"},
{"quote":"As an atheist, I am angry that we live in a society in which the plain truth cannot be spoken without offending 90% of the population.", "author": "Sam Harris"},
{"quote":"The truth is, I'm proud of the life I've lived so far, and though I've made my share of mistakes, I have no regrets.", "author": "Carly Fiorina"},
{"quote":"Like all dreamers, I mistook disenchantment for truth.", "author": "Jean-Paul Sartre"},
{"quote":"Nothing is beautiful, only man: on this piece of naivete rests all aesthetics, it is the first truth of aesthetics. Let us immediately add its second: nothing is ugly but degenerate man - the domain of aesthetic judgment is therewith defined.", "author": "Friedrich Nietzsche"},
{"quote":"The truth of the matter is that you always know the right thing to do. The hard part is doing it.", "author": "Norman Schwarzkopf"},
{"quote":"When governments rely increasingly on sophisticated public relations agencies, public debate disappears and is replaced by competing propaganda campaigns, with all the accompanying deceits. Advertising isn't about truth or fairness or rationality, but about mobilising deeper and more primitive layers of the human mind.", "author": "Brian Eno"},
{"quote":"I told my wife the truth. I told her I was seeing a psychiatrist. Then she told me the truth: that she was seeing a psychiatrist, two plumbers, and a bartender.", "author": "Rodney Dangerfield"},
{"quote":"If you want to become fully mature in the Lord, you must learn to love truth. Otherwise, you will always leave open a door of deception for the enemy to take what is meant to be yours.", "author": "Joyce Meyer"},
{"quote":"It is good to express a thing twice right at the outset and so to give it a right foot and also a left one. Truth can surely stand on one leg, but with two it will be able to walk and get around.", "author": "Friedrich Nietzsche"},
{"quote":"Truth is a demure lady, much too ladylike to knock you on your head and drag you to her cave. She is there, but people must want her, and seek her out.", "author": "William F. Buckley, Jr."},
{"quote":"Romantic love is an illusion. Most of us discover this truth at the end of a love affair or else when the sweet emotions of love lead us into marriage and then turn down their flames.", "author": "Thomas Moore"},
{"quote":"Discrimination is a hellhound that gnaws at Negroes in every waking moment of their lives to remind them that the lie of their inferiority is accepted as truth in the society dominating them.", "author": "Martin Luther King, Jr."},
{"quote":"There is no man more dangerous, in a position of power, than he who refuses to accept as a working truth the idea that all a man does should make for rightness and soundness, that even the fixing of a tariff rate must be moral.", "author": "Ida Tarbell"},
{"quote":"You don't learn from successes; you don't learn from awards; you don't learn from celebrity; you only learn from wounds and scars and mistakes and failures. And that's the truth.", "author": "Jane Fonda"},
{"quote":"I see that the path of progress has never taken a straight line, but has always been a zigzag course amid the conflicting forces of right and wrong, truth and error, justice and injustice, cruelty and mercy.", "author": "Kelly Miller"},
{"quote":"The preservation of peace and the guaranteeing of man's basic freedoms and rights require courage and eternal vigilance: courage to speak and act - and if necessary, to suffer and die - for truth and justice; eternal vigilance, that the least transgression of international morality shall not go undetected and unremedied.", "author": "Haile Selassie"},
{"quote":"The sad truth is that most evil is done by people who never make up their minds to be good or evil.", "author": "Hannah Arendt"},
{"quote":"A lot of guys go, 'Hey, Yog, say a Yogi-ism.' I tell 'em, 'I don't know any.' They want me to make one up. I don't make 'em up. I don't even know when I say it. They're the truth. And it is the truth. I don't know.", "author": "Yogi Berra"},
{"quote":"Above all, I would teach him to tell the truth Truth-telling, I have found, is the key to responsible citizenship. The thousands of criminals I have seen in 40 years of law enforcement have had one thing in common: Every single one was a liar.", "author": "J. Edgar Hoover"},
{"quote":"The truth is, I've never fooled anyone. I've let men sometimes fool themselves.", "author": "Marilyn Monroe"},
{"quote":"The truth is, as most of us know, that global warming is real and humans are major contributors, mainly because we wastefully burn fossil fuels.", "author": "David Suzuki"},
{"quote":"Science is the search for truth, that is the effort to understand the world: it involves the rejection of bias, of dogma, of revelation, but not the rejection of morality.", "author": "Linus Pauling"},
{"quote":"I am amazed about how everyone wants to know about my love life. They whisper to me, 'Tell me the truth? Is it true?' Who cares? Because we have this job, we are to say to everybody what we do, or with whom we sleep? It's a bit absurd, but that's why everybody lies so much.", "author": "Penelope Cruz"},
{"quote":"Children say that people are hung sometimes for speaking the truth.", "author": "Joan of Arc"},
{"quote":"I have been known for some time as a person who speaks the truth and speaks it strongly. I have always called a liar a liar and a hypocrite a hypocrite.", "author": "Cindy Sheehan"},
{"quote":"In seeking truth you have to get both sides of a story.", "author": "Walter Cronkite"},
{"quote":"I believe that one key to success is to accept truth, no matter how it's spoken.", "author": "Robert Kiyosaki"},
{"quote":"I have learned the hard way to mind my business, without judging who people are and what they do. I am more troubled by the lack of space being provided for the truth to unfold. Humans cannot seem to wait for or honor the truth. Instead, we make it up based on who we believe people should or should not be.", "author": "Iyanla Vanzant"},
{"quote":"For above all things Love means sweetness, and truth, and measure; yea, loyalty to the loved one and to your word. And because of this I dare not meddle with so high a matter.", "author": "Marie de France"},
{"quote":"We should not pretend to understand the world only by the intellect. The judgement of the intellect is only part of the truth.", "author": "Carl Jung"},
{"quote":"Nothing is more noble, nothing more venerable than fidelity. Faithfulness and truth are the most sacred excellences and endowments of the human mind.", "author": "Marcus Tullius Cicero"},
{"quote":"Two qualities are indispensable: first, an intellect that, even in the darkest hour, retains some glimmerings of the inner light which leads to truth; and second, the courage to follow this faint light wherever it may lead.", "author": "Carl von Clausewitz"},
{"quote":"Life is an unfoldment, and the further we travel the more truth we can comprehend. To understand the things that are at our door is the best preparation for understanding those that lie beyond.", "author": "Hypatia"},
{"quote":"Some people have a difficult time facing truth and reality. They prefer to live in a make-believe world, pretending that certain things aren't happening.", "author": "Joyce Meyer"},
{"quote":"To be afraid is to behave as if the truth were not true.", "author": "Bayard Rustin"},
{"quote":"There are very few human beings who receive the truth, complete and staggering, by instant illumination. Most of them acquire it fragment by fragment, on a small scale, by successive developments, cellularly, like a laborious mosaic.", "author": "Anais Nin"},
{"quote":"The Apology opened the opportunity for a new relationship based on mutual respect and mutual responsibility between Indigenous and non-Indigenous Australia. Because without mutual respect and mutual responsibility, the truth is we can achieve very little.", "author": "Kevin Rudd"},
{"quote":"In fact men will fight for a superstition quite as quickly as for a living truth - often more so, since a superstition is so intangible you cannot get at it to refute it, but truth is a point of view, and so is changeable.", "author": "Hypatia"},
{"quote":"And, after all, what is a lie? 'Tis but the truth in a masquerade.", "author": "Alexander Pope"},
{"quote":"When you want to fool the world, tell the truth.", "author": "Otto von Bismarck"},
{"quote":"The word theatre comes from the Greeks. It means the seeing place. It is the place people come to see the truth about life and the social situation.", "author": "Stella Adler"},
{"quote":"It always amuses me that the biggest praise for my work comes for the imagination, while the truth is that there's not a single line in all my work that does not have a basis in reality. The problem is that Caribbean reality resembles the wildest imagination.", "author": "Gabriel Garcia Marquez"},
{"quote":"Truth is the glue that holds government together.", "author": "Gerald R. Ford"},
{"quote":"We must trust to nothing but facts: these are presented to us by nature and cannot deceive. We ought, in every instance, to submit our reasoning to the test of experiment, and never to search for truth but by the natural road of experiment and observation.", "author": "Antoine Lavoisier"},
{"quote":"I guess rumors are more exciting than the truth.", "author": "Venus Williams"},
{"quote":"I don't think I ever expected anything like an Oscar ever, to tell you the truth. That is not my motivation when I do these roles. I really am motivated by being able to work with great people and create a body of work that I can look back and be proud of.", "author": "Leonardo DiCaprio"},
{"quote":"I never did give anybody hell. I just told the truth and they thought it was hell.", "author": "Harry S Truman"},
{"quote":"Truth is confirmed by inspection and delay; falsehood by haste and uncertainty.", "author": "Tacitus"},
{"quote":"I think there are so many books out there written on relationships and romance that women are the authors of. How can women know exactly how men think? And there are so many guys out there with relationship books who are just not telling the truth. They have shaded parts.", "author": "Steve Harvey"},
{"quote":"'Men have forgotten this truth,' said the fox. 'But you must not forget it. You become responsible, forever, for what you have tamed.'", "author": "Antoine de Saint-Exupery"},
{"quote":"I have made the most profound apology in front of the Truth Commission and on other occasions about the injustices which were wrought by apartheid.", "author": "F. W. de Klerk"},
{"quote":"A good man often appears gauche simply because he does not take advantage of the myriad mean little chances of making himself look stylish. Preferring truth to form, he is not constantly at work upon the facade of his appearance.", "author": "Alanis Morissette"},
{"quote":"If I can get you to laugh with me, you like me better, which makes you more open to my ideas. And if I can persuade you to laugh at the particular point I make, by laughing at it you acknowledge its truth.", "author": "John Cleese"},
{"quote":"The possession of arbitrary power has always, the world over, tended irresistibly to destroy humane sensibility, magnanimity, and truth.", "author": "Frederick Law Olmsted"},
{"quote":"The truth is that I don't have a favourite goal. I remember important goals more than I do favourite goals, like goals in the Champions League where I had the opportunity to have scored in both finals I have played in. Finals in the World Cup or Copa del Rey are the ones that have stayed with me for longer or that I remember more.", "author": "Lionel Messi"},
{"quote":"I have nothing new to teach the world. Truth and Non-violence are as old as the hills. All I have done is to try experiments in both on as vast a scale as I could.", "author": "Mahatma Gandhi"},
{"quote":"The truth is I love being alive. And I love feeling free. So if I can't have those things then I feel like a caged animal and I'd rather not be in a cage. I'd rather be dead. And it's real simple. And I think it's not that uncommon.", "author": "Angelina Jolie"},
{"quote":"There are two ways of lying. One, not telling the truth and the other, making up statistics.", "author": "Josefina Vazquez Mota"},
{"quote":"Racism oppresses its victims, but also binds the oppressors, who sear their consciences with more and more lies until they become prisoners of those lies. They cannot face the truth of human equality because it reveals the horror of the injustices they commit.", "author": "Alveda King"},
{"quote":"It is not when truth is dirty, but when it is shallow, that the lover of knowledge is reluctant to step into its waters.", "author": "Friedrich Nietzsche"},
{"quote":"God's truth judges created things out of love, and Satan's truth judges them out of envy and hatred.", "author": "Dietrich Bonhoeffer"},
{"quote":"Fiction is the truth inside the lie.", "author": "Stephen King"},
{"quote":"The truth is that neither British nor American imperialism was or is idealistic. It has always been driven by economic or strategic interests.", "author": "Charley Reese"},
{"quote":"Honest communication is built on truth and integrity and upon respect of the one for the other.", "author": "Benjamin E. Mays"},
{"quote":"Clouds and darkness surround us, yet Heaven is just, and the day of triumph will surely come, when justice and truth will be vindicated.", "author": "Mary Todd Lincoln"},
{"quote":"Politeness and civility are the best capital ever invested in business. Large stores, gilt signs, flaming advertisements, will all prove unavailing if you or your employees treat your patrons abruptly. The truth is, the more kind and liberal a man is, the more generous will be the patronage bestowed upon him.", "author": "P. T. Barnum"},
{"quote":"My parents, and librarians along the way, taught me about the space between words; about the margins, where so many juicy moments of life and spirit and friendship could be found. In a library, you could find miracles and truth and you might find something that would make you laugh so hard that you get shushed, in the friendliest way.", "author": "Anne Lamott"},
{"quote":"Tell the truth, work hard, and come to dinner on time.", "author": "Gerald R. Ford"},
{"quote":"God, as Truth, has been for me a treasure beyond price. May He be so to every one of us.", "author": "Mahatma Gandhi"},
{"quote":"One of the peculiar sins of the twentieth century which we've developed to a very high level is the sin of credulity. It has been said that when human beings stop believing in God they believe in nothing. The truth is much worse: they believe in anything.", "author": "Malcolm Muggeridge"},
{"quote":"The opposite of a fact is falsehood, but the opposite of one profound truth may very well be another profound truth.", "author": "Niels Bohr"},
{"quote":"There are also two kinds of truths: truth of reasoning and truths of fact. Truths of reasoning are necessary and their opposite is impossible; those of fact are contingent and their opposite is possible.", "author": "Gottfried Leibniz"},
{"quote":"The oblique paradox of propaganda is that the lie in the throat becomes, by repetition, the truth in the heart.", "author": "John Grierson"},
{"quote":"In the case of maternal health care, you look at, well naturally, it's the mother who's the customer, who makes the decisions. But in truth, the mother in many areas, in certain parts of India, the mother has very little decision-making power at all. The real decision-maker is the mother-in-law.", "author": "Jacqueline Novogratz"},
{"quote":"Richard Nixon is a no good, lying bastard. He can lie out of both sides of his mouth at the same time, and if he ever caught himself telling the truth, he'd lie just to keep his hand in.", "author": "Harry S Truman"},
{"quote":"Rebellion without truth is like spring in a bleak, arid desert.", "author": "Khalil Gibran"},
{"quote":"Memory is a complicated thing, a relative to truth, but not its twin.", "author": "Barbara Kingsolver"},
{"quote":"Attempting to get at truth means rejecting stereotypes and cliches.", "author": "Harold Evans"},
{"quote":"I think life is difficult and that's that. I am not at all - absolutely not at all - interested in the pursuit of happiness. I am not interested in the pursuit of positivity. I am interested in pursuing a truth, and the truth often seems to be not happiness but its opposite.", "author": "Jamaica Kincaid"},
{"quote":"One of the pitfalls of writing about illness is that it is very easy to imagine people with cancer as either these wise, beyond-their-years creatures or else these sad-eyed, tragic people. And the truth is people living with cancer are very much like people who are not living with cancer.", "author": "John Green"},
{"quote":"I can't say why people lie; they just do. Everyone has their own reasons for not telling the truth.", "author": "Eric Carr"},
{"quote":"The truth is that we don't need everyone to like us; we need a few people to love us. Because what's better than being roundly liked is being fully known - an impossibility both professionally and personally if you're so busy being likable that you forget to be yourself.", "author": "Jessica Valenti"},
{"quote":"The truth is that we can learn to condition our minds, bodies, and emotions to link pain or pleasure to whatever we choose. By changing what we link pain and pleasure to, we will instantly change our behaviors.", "author": "Tony Robbins"},
{"quote":"It is my feeling that Time ripens all things; with Time all things are revealed; Time is the father of truth.", "author": "Francois Rabelais"},
{"quote":"Knowledge rests not upon truth alone, but upon error also.", "author": "Carl Jung"},
{"quote":"There are, in truth, no specialties in medicine, since to know fully many of the most important diseases a man must be familiar with their manifestations in many organs.", "author": "William Osler"},
{"quote":"You know, I think many people have the mistaken impression that Congress regulates Wall Street. In truth that's not the case. The real truth is that Wall Street regulates the Congress.", "author": "Bernie Sanders"},
{"quote":"Our situation today shows that beauty demands for itself at least as much courage and decision as do truth and goodness, and she will not allow herself to be separated and banned from her two sisters without taking them along with herself in an act of mysterious vengeance.", "author": "Hans Urs von Balthasar"},
{"quote":"When a truth is necessary, the reason for it can be found by analysis, that is, by resolving it into simpler ideas and truths until the primary ones are reached.", "author": "Gottfried Leibniz"},
{"quote":"And we should consider every day lost on which we have not danced at least once. And we should call every truth false which was not accompanied by at least one laugh.", "author": "Friedrich Nietzsche"},
{"quote":"Without accepting the fact that everything changes, we cannot find perfect composure. But unfortunately, although it is true, it is difficult for us to accept it. Because we cannot accept the truth of transience, we suffer.", "author": "Shunryu Suzuki"},
{"quote":"But one of the things I learned is that when you fight for something you believe in and you tell the truth and you do your best, you can always hold your head up high and no one can take that away from you.", "author": "Vanessa Kerry"},
{"quote":"Whoever undertakes to set himself up as a judge of Truth and Knowledge is shipwrecked by the laughter of the gods.", "author": "Albert Einstein"},
{"quote":"Truth never damages a cause that is just.", "author": "Mahatma Gandhi"},
{"quote":"I am not afraid of the pen, or the scaffold, or the sword. I will tell the truth wherever I please.", "author": "Mother Jones"},
{"quote":"The tendency of modern scientific teaching is to neglect the great books, to lay far too much stress upon relatively unimportant modern work, and to present masses of detail of doubtful truth and questionable weight in such a way as to obscure principles.", "author": "Ronald Fisher"},
{"quote":"The truth is, we're all cyborgs with cell phones and online identities.", "author": "Geoff Johns"},
{"quote":"The Cold War had become a battlefield marked by doublespeak. Disguise, distortion, and deception were accepted as reality. Truth was promised in a serum.", "author": "Annie Jacobsen"},
{"quote":"The truth is, no one of us can be free until everybody is free.", "author": "Maya Angelou"},
{"quote":"Why shouldn't truth be stranger than fiction? Fiction, after all, has to make sense.", "author": "Mark Twain"},
{"quote":"You don't have to sort of enhance reality. There is nothing stranger than truth.", "author": "Annie Leibovitz"},
{"quote":"Art is not merely an imitation of the reality of nature, but in truth a metaphysical supplement to the reality of nature, placed alongside thereof for its conquest.", "author": "Friedrich Nietzsche"},
{"quote":"I am a lover of truth, a worshipper of freedom, a celebrant at the altar of language and purity and tolerance.", "author": "Stephen Fry"},
{"quote":"You believe happiness to be derived from the place in which once you have been happy, but in truth it is centered in ourselves.", "author": "Franz Schubert"},
{"quote":"Your aim as a photographer is to get a picture of that person that means something. Portraits aren't fantasies; they need to tell a truth.", "author": "Tim Walker"},
{"quote":"In truth, I am a single mother. But I don't feel alone at all in parenting my daughter. Krishna has a whole other side of her family who loves her, too. And so Krishna is parented by me, but also by her grandmother and aunts and cousins and uncles and friends.", "author": "Padma Lakshmi"},
{"quote":"There is a distinction between fact and truth. Truth has an element of revelation about it. If something is true, it does more than strike one as merely being so.", "author": "Lucian Freud"},
{"quote":"Here's the thing with me and the religious thing. This is the flat-out truth: I find the religiosity and philosophy in the music. I don't find it anywhere else.", "author": "Bob Dylan"},
{"quote":"Defending the truth is not something one does out of a sense of duty or to allay guilt complexes, but is a reward in itself.", "author": "Simone de Beauvoir"},
{"quote":"Humor is something that thrives between man's aspirations and his limitations. There is more logic in humor than in anything else. Because, you see, humor is truth.", "author": "Victor Borge"},
{"quote":"Scarce any problem will appear more hard and difficult, than that of determining the distance of the Sun from the Earth very near the truth: but even this... will without much labour be effected.", "author": "Edmond Halley"},
{"quote":"No one should ever say that it was my ignorance if I did or showed forth anything however small according to God's good pleasure; but let this be your conclusion and let it so be thought, that - as is the perfect truth - it was the gift of God.", "author": "Saint Patrick"},
{"quote":"The truth is that there is only one terminal dignity - love. And the story of a love is not important - what is important is that one is capable of love. It is perhaps the only glimpse we are permitted of eternity.", "author": "Helen Hayes"},
{"quote":"Religion is about turning untested belief into unshakable truth through the power of institutions and the passage of time.", "author": "Richard Dawkins"},
{"quote":"Words can be said in bitterness and anger, and often there seems to be an element of truth in the nastiness. And words don't go away, they just echo around.", "author": "Jane Goodall"},
{"quote":"Truth is on the side of the oppressed.", "author": "Malcolm X"},
{"quote":"Truth is the daughter of time, and I feel no shame in being her midwife.", "author": "Johannes Kepler"},
{"quote":"The sad truth is that opportunity doesn't knock twice.", "author": "Gloria Estefan"},
{"quote":"There are various eyes. Even the Sphinx has eyes: and as a result there are various truths, and as a result there is no truth.", "author": "Friedrich Nietzsche"},
{"quote":"Representation of the world, like the world itself, is the work of men; they describe it from their own point of view, which they confuse with the absolute truth.", "author": "Simone de Beauvoir"},
{"quote":"It is hard to believe that a man is telling the truth when you know that you would lie if you were in his place.", "author": "H. L. Mencken"},
{"quote":"God is, even though the whole world deny him. Truth stands, even if there be no public support. It is self-sustained.", "author": "Mahatma Gandhi"},
{"quote":"Science, my lad, is made up of mistakes, but they are mistakes which it is useful to make, because they lead little by little to the truth.", "author": "Jules Verne"},
{"quote":"The truth is that I oppose the Iraq war, just as I opposed the Vietnam War, because these two conflicts have weakened the U.S. and diminished our standing in the world and our national security.", "author": "George McGovern"},
{"quote":"The truth is, no matter what your lifestyle or occupation, nothing can really stop you when you're allowing yourself to be exactly who you want to be.", "author": "Hayley Williams"},
{"quote":"When I was a young person I went to the university and I learned a rational language, to think with the left side of the brain. But in the right side of the brain you have intuition and imagination. Words are not the truth; they indicate the way to go, but you need to go alone, in silence. Symbols have a language that kills the words.", "author": "Alejandro Jodorowsky"},
{"quote":"You can't get there alone. People have to help you, and I do believe in karma. I believe in paybacks. You get people to help you by telling the truth, by being earnest.", "author": "Randy Pausch"},
{"quote":"All religion seems to need to prove that it's the only truth. And that's where it turns demonic. Because that's when you get religious wars and persecutions and burning heretics at the stake.", "author": "John Shelby Spong"},
{"quote":"My parents taught me honesty, truth, compassion, kindness and how to care for people. Also, they encouraged me to take risks, to boldly go. They taught me that the greatest danger in life is not taking the adventure.", "author": "Brian Blessed"},
{"quote":"If you're a prosecutor, and you believe the defendant is guilty, you only talk about ultimate truth, but not intermediate truth. If you're the defense attorney, you care deeply about intermediate truth, but you tend to neglect ultimate truth.", "author": "Alan Dershowitz"},
{"quote":"You will find truth more quickly through delight than gravity. Let out a little more string on your kite.", "author": "Alan Cohen"},
{"quote":"Music makes me high on stage, and that's the truth. It's like being almost addicted to music.", "author": "Jimi Hendrix"},
{"quote":"It does not require many words to speak the truth.", "author": "Chief Joseph"},
{"quote":"Pleasure without God, without the sacred boundaries, will actually leave you emptier than before. And this is biblical truth, this is experiential truth. The loneliest people in the world are amongst the wealthiest and most famous who found no boundaries within which to live. That is a fact I've seen again and again.", "author": "Ravi Zacharias"},
{"quote":"I talk about the gods, I am an atheist. But I am an artist too, and therefore a liar. Distrust everything I say. I am telling the truth.", "author": "Ursula K. Le Guin"},
{"quote":"The history of science shows that theories are perishable. With every new truth that is revealed we get a better understanding of Nature and our conceptions and views are modified.", "author": "Nikola Tesla"},
{"quote":"The sea - this truth must be confessed - has no generosity. No display of manly qualities - courage, hardihood, endurance, faithfulness - has ever been known to touch its irresponsible consciousness of power.", "author": "Joseph Conrad"},
{"quote":"Country music is the people's music. It just speaks about real life and about truth and it tells things how they really are.", "author": "Faith Hill"},
{"quote":"To the scientist there is the joy in pursuing truth which nearly counteracts the depressing revelations of truth.", "author": "H. P. Lovecraft"},
{"quote":"Irony regards every simple truth as a challenge.", "author": "Mason Cooley"},
{"quote":"The truth is the best picture, the best propaganda.", "author": "Robert Capa"},
{"quote":"I was bold in the pursuit of knowledge, never fearing to follow truth and reason to whatever results they led, and bearding every authority which stood in their way.", "author": "Thomas Jefferson"},
{"quote":"To the living we owe respect, but to the dead we owe only the truth.", "author": "Voltaire"},
{"quote":"Truth is so obscure in these times, and falsehood so established, that, unless we love the truth, we cannot know it.", "author": "Blaise Pascal"},
{"quote":"There is no better way of exercising the imagination than the study of law. No poet ever interpreted nature as freely as a lawyer interprets the truth.", "author": "Jean Giraudoux"},
{"quote":"The scientist only imposes two things, namely truth and sincerity, imposes them upon himself and upon other scientists.", "author": "Erwin Schrodinger"},
{"quote":"Now all we need is to continue to speak the truth fearlessly, and we shall add to our number those who will turn the scale to the side of equal and full justice in all things.", "author": "Lucy Stone"},
{"quote":"I hate newspapermen. They come into camp and pick up their camp rumors and print them as facts. I regard them as spies, which, in truth, they are.", "author": "William Tecumseh Sherman"},
{"quote":"Postmodernism was a reaction to modernism. Where modernism was about objectivity, postmodernism was about subjectivity. Where modernism sought a singular truth, postmodernism sought the multiplicity of truths.", "author": "Miguel Syjuco"},
{"quote":"It is error alone which needs the support of government. Truth can stand by itself.", "author": "Thomas Jefferson"},
{"quote":"They whom truth and wisdom lead, can gather honey from a weed.", "author": "William Cowper"},
{"quote":"I don't want to waste anyone's time or money. I want to give people some truth and positive heart lift.", "author": "Mos Def"},
{"quote":"Madness is the absolute break with the work of art; it forms the constitutive moment of abolition, which dissolves in time the truth of the work of art.", "author": "Michel Foucault"},
{"quote":"Truth is a great flirt.", "author": "Franz Liszt"},
{"quote":"War is wrong. Conscription for war is inconsistent with freedom of conscience, which is not merely the right to believe but to act on the degree of truth that one receives, to follow a vocation which is God-inspired and God-directed.", "author": "Bayard Rustin"},
{"quote":"Truth is something which can't be told in a few words. Those who simplify the universe only reduce the expansion of its meaning.", "author": "Anais Nin"},
{"quote":"Sometimes we look at gay being a bigger sin than being proud or not telling the truth. I don't think God categorizes sins.", "author": "Joel Osteen"},
{"quote":"For thousands of years, human beings have been obsessed with beauty, truth, love, honor, altruism, courage, social relationships, art, and God. They all go together as subjective experiences, and it's a straw man to set God up as the delusion. If he is, then so is truth itself or beauty itself.", "author": "Deepak Chopra"},
{"quote":"God is another name for human intelligence raised above all error and imperfection, and extended to all possible truth.", "author": "William Ellery Channing"},
{"quote":"I'm always trying to do the impossible to please people. It comes from not being secure in myself and not looking at the things within I have to fix. Sometimes you keep going because you don't want to face the truth.", "author": "Naomi Campbell"},
{"quote":"The truth is, somebody is always talking about you, so you have to let it go... if it's not a part of your God-given destiny.", "author": "Joel Osteen"},
{"quote":"We are volcanoes. When we women offer our experience as our truth, as human truth, all the maps change. There are new mountains.", "author": "Ursula K. Le Guin"},
{"quote":"If we bring not the good courage of minds covetous of truth, and truth only, prepared to hear all things, and decide upon all things, according to evidence, we should do more wisely to sit down contented in ignorance, than to bestir ourselves only to reap disappointment.", "author": "Frances Wright"},
{"quote":"I have discovered the art of deceiving diplomats. I tell them the truth and they never believe me.", "author": "Camillo di Cavour"},
{"quote":"My people are going to learn the principles of democracy, the dictates of truth and the teachings of science. Superstition must go.", "author": "Mustafa Kemal Ataturk"},
{"quote":"There is risk and truth to yourselves and the world before you.", "author": "Seamus Heaney"},
{"quote":"I've led a school whose faculty and students examine and discuss and debate every aspect of our law and legal system. And what I've learned most is that no one has a monopoly on truth or wisdom. I've learned that we make progress by listening to each other, across every apparent political or ideological divide.", "author": "Elena Kagan"},
{"quote":"I guess I'm pretty much of a lone wolf. I don't say I don't like people at all, but, to tell you the truth, I only like it then if I have a chance to look deep into their hearts and their minds.", "author": "Bela Lugosi"},
{"quote":"The essential truth is that sometimes you're worried that they'll find out it's a fluke, that you don't really have it. You've lost the muse or - the worst dread - you never had it at all. I went through all that madness early on.", "author": "Robin Williams"},
{"quote":"I am certain of nothing but the holiness of the heart's affections, and the truth of imagination.", "author": "John Keats"},
{"quote":"Given the scale of trauma caused by the genocide, Rwanda has indicated that however thin the hope of a community can be, a hero always emerges. Although no one can dare claim that it is now a perfect state, and that no more work is needed, Rwanda has risen from the ashes as a model or truth and reconciliation.", "author": "Wole Soyinka"},
{"quote":"The truth is that men are tired of liberty.", "author": "Benito Mussolini"},
{"quote":"The truth is the Super Bowl long ago became more than just a football game. It's part of our culture like turkey at Thanksgiving and lights at Christmas, and like those holidays beyond their meaning, a factor in our economy.", "author": "Bob Schieffer"},
{"quote":"Everyone with a cell phone thinks they're a photographer. Everyone with a laptop thinks they're a journalist. But they have no training, and they have no idea of what we keep to in terms of standards, as in what's far out and what's reality. And they have no dedication to truth.", "author": "Helen Thomas"},
{"quote":"To kill an error is as good a service as, and sometimes even better than, the establishing of a new truth or fact.", "author": "Charles Darwin"},
{"quote":"We occasionally stumble over the truth but most of us pick ourselves up and hurry off as if nothing had happened.", "author": "Winston Churchill"},
{"quote":"I know how easy it is for one to stay well within moral, ethical, and legal bounds through the skillful use of words - and to thereby spin, sidestep, circumvent, or bend a truth completely out of shape. To that extent, we are all liars on numerous occasions.", "author": "Sidney Poitier"},
{"quote":"Wine comes in at the mouth And love comes in at the eye; That's all we shall know for truth Before we grow old and die.", "author": "William Butler Yeats"},
{"quote":"What I've found - and the older I get, the more I understand this and stand behind it - is, my whole life has been an exploration of telling the truth. It's scary to be truthful, and it's scary to reveal yourself, and I'm very attracted to doing things that scare me.", "author": "Jane Wiedlin"},
{"quote":"Speak the truth, do not yield to anger; give, if thou art asked for little; by these three steps thou wilt go near the gods.", "author": "Confucius"},
{"quote":"We are not afraid to entrust the American people with unpleasant facts, foreign ideas, alien philosophies, and competitive values. For a nation that is afraid to let its people judge the truth and falsehood in an open market is a nation that is afraid of its people.", "author": "John F. Kennedy"},
{"quote":"I seek truth over a lie; I seek justice over injustice; I seek righteousness over the rewards of evildoers, and I love Allah more than I love the state.", "author": "H. Rap Brown"},
{"quote":"Only the dreamer shall understand realities, though in truth his dreaming must be not out of proportion to his waking.", "author": "Margaret Fuller"},
{"quote":"To me a real patriot is like a real friend. Who's your real friend? It's the person who tells you the truth. That's who my real friends are. So, you know, I think as far as our country goes, we need more people who will do that.", "author": "Bill Maher"},
{"quote":"I am saddened by how people treat one another and how we are so shut off from one another and how we judge one another, when the truth is, we are all one connected thing. We are all from the same exact molecules.", "author": "Ellen DeGeneres"},
{"quote":"Matangi's mantra is aim, which is MIA backwards. She fights for freedom of speech and stands for truth, and lives in the ghetto because her dad was the first person in Hindu mythology who came from the 'hood, but had gained enlightenment through not being a Brahmin.", "author": "M.I.A."},
{"quote":"Truth that is not undergirded by love makes the truth obnoxious and the possessor of it repulsive.", "author": "Ravi Zacharias"},
{"quote":"We were talking about the space between us all and the people who hide themselves behind a wall of illusion. Never glimpse the truth - then it's far too late when they pass away.", "author": "George Harrison"},
{"quote":"Why would anyone lie? The truth is always more colorful.", "author": "James Hall"},
{"quote":"By and large, language is a tool for concealing the truth.", "author": "George Carlin"},
{"quote":"The truth does not change according to our ability to stomach it.", "author": "Flannery O'Connor"},
{"quote":"A lot of country music is sad. I think most art comes out of poverty and hard times. It applies to music. Three chords and the truth - that's what a country song is. There is a lot of heartache in the world.", "author": "Willie Nelson"},
{"quote":"We must take positions. Our weakness in the West is born of the fact of so-called 'objectivity.' Objectivity does not exist - it cannot exist!... The word is a hypocrisy which is sustained by the lie that the truth stays in the middle. No, sir: Sometimes truth stays on one side only.", "author": "Oriana Fallaci"},
{"quote":"I feel like my mission is to be honest with myself. My mission is to share my truth - share, not give. I think that's what an artist is supposed to do: I think they share.", "author": "Gerard Way"},
{"quote":"There are sadistic scientists who hurry to hunt down errors instead of establishing the truth.", "author": "Marie Curie"},
{"quote":"The said truth is that it is the greatest happiness of the greatest number that is the measure of right and wrong.", "author": "Jeremy Bentham"},
{"quote":"Truth is the torch that gleams through the fog without dispelling it.", "author": "Claude Adrien Helvetius"},
{"quote":"So far as hypotheses are concerned, let no one expect anything certain from astronomy, which cannot furnish it, lest he accept as the truth ideas conceived for another purpose, and depart from this study a greater fool than when he entered it.", "author": "Nicolaus Copernicus"},
{"quote":"People think SEALs are cold-blooded, heartless, wound-up, brainwashed killers. They imagine you can just point a SEAL in a direction and say, 'Go kill.' The truth is you're talking about a bunch of kind-hearted, jovial guys. The only thing that separates them is mental toughness.", "author": "Howard E. Wasdin"},
{"quote":"When virtue is lost, benevolence appears, when benevolence is lost right conduct appears, when right conduct is lost, expedience appears. Expediency is the mere shadow of right and truth; it is the beginning of disorder.", "author": "Lao Tzu"},
{"quote":"There really can be no peace without justice. There can be no justice without truth. And there can be no truth, unless someone rises up to tell you the truth.", "author": "Louis Farrakhan"},
{"quote":"A new scientific truth does not triumph by convincing its opponents and making them see the light, but rather because its opponents eventually die, and a new generation grows up that is familiar with it.", "author": "Max Planck"},
{"quote":"You're not going to be liked by everybody when you speak the truth. I don't speak the truth to put people down; I don't speak the truth to show disrespect.", "author": "Hope Solo"},
{"quote":"But in truth, should I meet with gold or spices in great quantity, I shall remain till I collect as much as possible, and for this purpose I am proceeding solely in quest of them.", "author": "Christopher Columbus"},
{"quote":"One may preach a covenant of grace more clearly than another... But when they preach a covenant of works for salvation, that is not truth.", "author": "Anne Hutchinson"},
{"quote":"Once you go inside and weed through the muck, you will find the real beauty, the truth about yourself.", "author": "Lindsay Wagner"},
{"quote":"The two things I understand best are stand-up comedy and martial arts. And those things require an ultimate grasp of the truth. You have to be objective about your skills and abilities to compete in both.", "author": "Joe Rogan"},
{"quote":"I get some of my ideas from watching my three daughters, but most of them come from my own memories of growing up. I can remember how romantic I was, not just about love, but romance in the classic sense - the romantic ideals: of honor and truth, of loyalty, sacrifice and fairness. Those were the elements that made a story satisfying to me.", "author": "Francine Pascal"},
{"quote":"The key to wisdom is this - constant and frequent questioning, for by doubting we are led to question and by questioning we arrive at the truth.", "author": "Peter Abelard"},
{"quote":"If you're going to tell people the truth, be funny or they'll kill you.", "author": "Billy Wilder"},
{"quote":"When one is frightened of the truth then it is never the whole truth that one has an inkling of.", "author": "Ludwig Wittgenstein"},
{"quote":"Truth is the silliest thing under the sun. Try to get a living by the Truth and go to the Soup Societies. Heavens! Let any clergyman try to preach the Truth from its very stronghold, the pulpit, and they would ride him out of his church on his own pulpit bannister.", "author": "Herman Melville"},
{"quote":"All photographs are accurate. None of them is the truth.", "author": "Richard Avedon"},
{"quote":"The oppressed peoples can liberate themselves only through struggle. This is a simple and clear truth confirmed by history.", "author": "Kim Il-sung"},
{"quote":"It is the truth of grace and not of the law that brings you true freedom. The truth of the law only binds you. In fact, religious bondage is one of the most crippling bondages with which a person can be encumbered. Religious bondage keeps one in constant fear, guilt, and anxiety.", "author": "Joseph Prince"},
{"quote":"If you accept that people are the products of evolution, then you have to have an open mind to the truth. Unfair discrimination exists whether we like it or not; I wouldn't have married a gum-chewing vegetarian.", "author": "James D. Watson"},
{"quote":"Education is not just about going to school and getting a degree. It's about widening your knowledge and absorbing the truth about life.", "author": "Shakuntala Devi"},
{"quote":"I think a lot of people mistake my confidence on stage for cockiness in real life, and that's actually farthest from the truth. When I'm on stage, I'm that confident and that cocky because I have a microphone in my hand, and there's a few thousand people staring at me. And I know they're there to laugh.", "author": "Russell Peters"},
{"quote":"Art is not a study of positive reality, it is the seeking for ideal truth.", "author": "John Ruskin"},
{"quote":"Tell the truth. Sing with passion. Work with laughter. Love with heart. 'Cause that's all that matters in the end.", "author": "Kris Kristofferson"},
{"quote":"When truth has no burning, then it is philosophy, when it gets burning from the heart, it becomes poetry.", "author": "Muhammad Iqbal"},
{"quote":"What the imagination seizes as beauty must be truth.", "author": "John Keats"},
{"quote":"Your experiences will be yours alone. But truth and best friendship will rarely if ever disappoint you.", "author": "Anne Lamott"},
{"quote":"Language is the house of the truth of Being.", "author": "Martin Heidegger"},
{"quote":"In every truth, the beneficiaries of a system cannot be expected to destroy it.", "author": "A. Philip Randolph"},
{"quote":"Truth is a point of view, but authenticity can't be faked.", "author": "Peter Guber"},
{"quote":"What is the difference between unethical and ethical advertising? Unethical advertising uses falsehoods to deceive the public; ethical advertising uses truth to deceive the public.", "author": "Vilhjalmur Stefansson"},
{"quote":"Truth can be stated in a thousand different ways, yet each one can be true.", "author": "Swami Vivekananda"},
{"quote":"The great enemy of the truth is very often not the lie, deliberate, contrived and dishonest, but the myth, persistent, persuasive and unrealistic.", "author": "John F. Kennedy"},
{"quote":"There is nothing more deceptive than an obvious fact.", "author": "Arthur Conan Doyle"},
{"quote":"All truth passes through three stages. First, it is ridiculed. Second, it is violently opposed. Third, it is accepted as being self-evident.", "author": "Arthur Schopenhauer"},
{"quote":"A lot of truth is said in jest.", "author": "Eminem"},
{"quote":"If you would be a real seeker after truth, it is necessary that at least once in your life you doubt, as far as possible, all things.", "author": "Rene Descartes"},
{"quote":"If you look for truth, you may find comfort in the end; if you look for comfort you will not get either comfort or truth only soft soap and wishful thinking to begin, and in the end, despair.", "author": "C. S. Lewis"},
{"quote":"Anyone who doesn't take truth seriously in small matters cannot be trusted in large ones either.", "author": "Albert Einstein"},
{"quote":"Betrayal is the only truth that sticks.", "author": "Arthur Miller"},
{"quote":"Every truth has two sides; it is as well to look at both, before we commit ourselves to either.", "author": "Aesop"},
{"quote":"Truth will ultimately prevail where there is pains to bring it to light.", "author": "George Washington"},
{"quote":"A lie gets halfway around the world before the truth has a chance to get its pants on.", "author": "Winston Churchill"},
{"quote":"We swallow greedily any lie that flatters us, but we sip only little by little at a truth we find bitter.", "author": "Denis Diderot"},
{"quote":"Whatever satisfies the soul is truth.", "author": "Walt Whitman"},
{"quote":"Even if you are a minority of one, the truth is the truth.", "author": "Mahatma Gandhi"},
{"quote":"Once you eliminate the impossible, whatever remains, no matter how improbable, must be the truth.", "author": "Arthur Conan Doyle"},
{"quote":"If I'd written all the truth I knew for the past ten years, about 600 people - including me - would be rotting in prison cells from Rio to Seattle today. Absolute truth is a very rare and dangerous commodity in the context of professional journalism.", "author": "Hunter S. Thompson"},
{"quote":"There are some people so addicted to exaggeration that they can't tell the truth without lying.", "author": "Josh Billings"},
{"quote":"Truth, like gold, is to be obtained not by its growth, but by washing away from it all that is not gold.", "author": "Leo Tolstoy"},
{"quote":"Experience has shown, and a true philosophy will always show, that a vast, perhaps the larger portion of the truth arises from the seemingly irrelevant.", "author": "Edgar Allan Poe"},
{"quote":"A dog barks when his master is attacked. I would be a coward if I saw that God's truth is attacked and yet would remain silent.", "author": "John Calvin"},
{"quote":"Truth will always be truth, regardless of lack of understanding, disbelief or ignorance.", "author": "W. Clement Stone"},
{"quote":"Truth exists; only lies are invented.", "author": "Georges Braque"},
{"quote":"Rather than love, than money, than fame, give me truth.", "author": "Henry David Thoreau"},
{"quote":"'Beauty is truth, truth beauty,' - that is all ye know on earth, and all ye need to know.", "author": "John Keats"},
{"quote":"People are needed to take up the challenge, strong people, who proclaim the truth, throw it in people's faces, and do what they can with their own two hands.", "author": "Abbe Pierre"},
{"quote":"A nation that is afraid to let its people judge the truth and falsehood in an open market is a nation that is afraid of its people.", "author": "John F. Kennedy"},
{"quote":"Man will occasionally stumble over the truth, but most of the time he will pick himself up and continue on.", "author": "Winston Churchill"},
{"quote":"I left in love, in laughter, and in truth, and wherever truth, love and laughter abide, I am there in spirit.", "author": "Bill Hicks"},
{"quote":"This is my truth, tell me yours.", "author": "Aneurin Bevan"},
{"quote":"The sole and basic source of our strength is the solidarity of workers, peasants and the intelligentsia, the solidarity of the nation, the solidarity of people who seek to live in dignity, truth, and in harmony with their conscience.", "author": "Lech Walesa"},
{"quote":"To lovers of the truth, nothing can be put before God and hope in Him.", "author": "Saint Basil"},
{"quote":"The harsh truth is, most red-haired men look like blondes who've spoiled from lack of refrigeration. They look like brown-haired men who've been composted out behind the barn. Yet that same pigmentation that on a man can resemble leaf mold or junkyard rust, a woman wears like a tiara of rubies.", "author": "Tom Robbins"},
{"quote":"Thank you... 'Real Housewives of Atlanta,' for demonstrating a universal truth: Idiots like me will always watch idiots like you fight on TV. You will forever be in my TiVo.", "author": "Jimmy Fallon"},
{"quote":"Truth is a thing immortal and perpetual, and it gives to us a beauty that fades not away in time.", "author": "Frank Norris"},
{"quote":"I don't bill myself as an atheist but as a naturalist. Naturalism is a belief system. A lot of scientists bristle at that. We all have to believe we can find the truth. Evidence is my guide. I rely on observation, experimentation and verification.", "author": "Greg Graffin"},
{"quote":"The truth is nobody can own anything. That was an unheard-of concept among indigenous people. We invented that.", "author": "Tom Shadyac"},
{"quote":"It is claimed, but with what truth we cannot say, that there is a well-defined propaganda among the aliens of colour to bring about the degeneration of the white race.", "author": "Emily Murphy"},
{"quote":"In wartime, truth is so precious that she should always be attended by a bodyguard of lies.", "author": "Winston Churchill"},
{"quote":"The pursuit of truth does not permit violence on one's opponent.", "author": "Mahatma Gandhi"},
{"quote":"Say not, 'I have found the truth,' but rather, 'I have found a truth.'", "author": "Khalil Gibran"},
{"quote":"It is one of the severest tests of friendship to tell your friend his faults. So to love a man that you cannot bear to see a stain upon him, and to speak painful truth through loving words, that is friendship.", "author": "Henry Ward Beecher"},
{"quote":"I was sure I'd set the world on fire, and it was hard for a young feller like me to realize the truth - that I hadn't set the world on fire, and I was totally unprepared to handle the consequences if 'The Big Trail' had been a success and launched me as a star.", "author": "John Wayne"},
{"quote":"In order to properly understand the big picture, everyone should fear becoming mentally clouded and obsessed with one small section of truth.", "author": "Xun Zi"},
{"quote":"Myths and creeds are heroic struggles to comprehend the truth in the world.", "author": "Ansel Adams"},
{"quote":"You must accept the truth from whatever source it comes.", "author": "Maimonides"},
{"quote":"Humor is always based on a modicum of truth. Have you ever heard a joke about a father-in-law?", "author": "Dick Clark"},
{"quote":"I've never really been one to try to be politically correct. I just feel truth is truth, and sometimes I probably offend some people.", "author": "Franklin Graham"},
{"quote":"The truth is that we were born to have it all. And part of our handicap as adults is that we no longer understand our potential.", "author": "Yehuda Berg"},
{"quote":"A testimony of the truth of the gospel does not come the same way to all people. Some receive it in a unique, life-changing experience. Others gain a testimony slowly, almost imperceptibly until, one day, they simply know.", "author": "Joseph B. Wirthlin"},
{"quote":"Have you heard of this new thing called the internet? It's giving people new expectations. It's allowing them to become their own expert. Knowledge lies anxious at their fingertips. Gloss over the truth in your advertising and you'll quickly be dismissed as a poser.", "author": "Roy H. Williams"},
{"quote":"All of us create our own versions of an event, of our lives, even, not because we're liars, necessarily, but because we can only see and understand the truth from our own viewpoint, and a shifting viewpoint at that.", "author": "Deb Caletti"},
{"quote":"The truth is, I don't have any problem with journalists - I count some of them as friends - also some of my heroes are journalists, I'm a big fan of Robert Fisk - great people or crazy people who are prepared to stand up for what's right.", "author": "Daniel Craig"},
{"quote":"The truth is I'm not actually an expert programmer! I really don't consider myself to be an expert at anything. For me, it's more about having a well-rounded and broad horizon. I think that's where a lot of the more interesting things come from - mashing up completely disparate aspects of life to create something new and original.", "author": "Aaron Koblin"},
{"quote":"All the religions of the world, while they may differ in other respects, unitedly proclaim that nothing lives in this world but Truth.", "author": "Mahatma Gandhi"},
{"quote":"I believe in the fundamental truth of all great religions of the world.", "author": "Mahatma Gandhi"},
{"quote":"One may sometimes tell a lie, but the grimace that accompanies it tells the truth.", "author": "Friedrich Nietzsche"},
{"quote":"Man approaches the unattainable truth through a succession of errors.", "author": "Aldous Huxley"},
{"quote":"Truth is the daughter of time, not of authority.", "author": "Francis Bacon"},
{"quote":"Truth is a good dog; but always beware of barking too close to the heels of an error, lest you get your brains kicked out.", "author": "Francis Bacon"},
{"quote":"Some taxpayers may object to a print journalism bailout on the grounds that it mostly benefits the liberal elite. And we can't blame taxpayers for being reluctant to subsidize the reportorial careers of J-school twerps who should have joined the Peace Corps and gone to Africa to 'speak truth to power' to Robert Mugabe.", "author": "P. J. O'Rourke"},
{"quote":"Believe those who are seeking the truth. Doubt those who find it.", "author": "Andre Gide"},
{"quote":"The great advantage about telling the truth is that nobody ever believes it.", "author": "Dorothy L. Sayers"},
{"quote":"My dad raised me with some good advice: 'Always tell the truth. Always shoot from the hip. You might not have many friends, but you'll never have enemies, because people will always know where you're coming from.'", "author": "Pink"},
{"quote":"But whether it be dream or truth, to do well is what matters. If it be truth, for truth's sake. If not, then to gain friends for the time when we awaken.", "author": "Pedro Calderon de la Barca"},
{"quote":"Time is the father of truth, its mother is our mind.", "author": "Giordano Bruno"},
{"quote":"Official history is merely a veil to hide the truth of what really happened. When the veil is lifted, again and again we see that not only is the official version not true, it is often 100% wrong.", "author": "David Icke"},
{"quote":"The scientist is motivated primarily by curiosity and a desire for truth.", "author": "Irving Langmuir"},
{"quote":"The usefulness of religion - the fact that it gives life meaning, that it makes people feel good - is not an argument for the truth of any religious doctrine. It's not an argument that it's reasonable to believe that Jesus really was born of a virgin or that the Bible is the perfect word of the creator of the universe.", "author": "Sam Harris"},
{"quote":"No human being will ever know the Truth, for even if they happen to say it by chance, they would not even known they had done so.", "author": "Xenophanes"},
{"quote":"I think he had a strange, passionate devotion to the truth and a horror at what he saw going on.", "author": "Ben Bradlee"},
{"quote":"Why do you think the fans like us - why they prefer our street raps over all that phony stuff out there? Because we're telling the real story of what it's like living in places like Compton. We're giving them reality. We're like reporters. We give them the truth.", "author": "Eazy-E"},
{"quote":"For me, exploration is about that journey to the interior, into your own heart. I'm always wondering, how will I act at my moment of truth? Will I rise up and do what's right, even if every fiber of my being is telling me otherwise?", "author": "Ann Bancroft"},
{"quote":"I don't think Bosnia is ready for reconciliation, but I do think it is ready for truth.", "author": "Paddy Ashdown"},
{"quote":"People like to cherry-pick the parts of their career that they're either in the midst of or that they're the most proud of, but the truth is careers and lives are tapestries.", "author": "Mike Rowe"},
{"quote":"Fiction is obliged to stick to possibilities. Truth isn't.", "author": "Mark Twain"},
{"quote":"We often want one thing and pray for another, not telling the truth even to the gods.", "author": "Lucius Annaeus Seneca"},
{"quote":"Not being known doesn't stop the truth from being true.", "author": "Richard Bach"},
{"quote":"That which you create in beauty and goodness and truth lives on for all time to come. Don't spend your life accumulating material objects that will only turn to dust and ashes.", "author": "Denis Waitley"},
{"quote":"As long as I tell the truth I feel that nobody can touch me.", "author": "Henry Rollins"},
{"quote":"I speak the truth not so much as I would, but as much as I dare, and I dare a little more as I grow older.", "author": "Michel de Montaigne"},
{"quote":"Even the most cynical can hardly be surprised by the antics of Nixon and his accomplices as they are gradually revealed. It matters little, at this point, where the exact truth lies in the maze of perjury, evasion, and of contempt for the normal - hardly inspiring - standards of political conduct.", "author": "Noam Chomsky"},
{"quote":"Justice is truth in action.", "author": "Benjamin Disraeli"},
{"quote":"It is only a man's own fundamental thoughts that have truth and life in them. For it is these that he really and completely understands. To read the thoughts of others is like taking the remains of someone else's meal, like putting on the discarded clothes of a stranger.", "author": "Arthur Schopenhauer"},
{"quote":"A day spent without the sight or sound of beauty, the contemplation of mystery, or the search of truth or perfection is a poverty-stricken day; and a succession of such days is fatal to human life.", "author": "Lewis Mumford"},
{"quote":"Chase after the truth like all hell and you'll free yourself, even though you never touch its coat tails.", "author": "Clarence Darrow"},
{"quote":"Comedy has to be based on truth. You take the truth and you put a little curlicue at the end.", "author": "Sid Caesar"},
{"quote":"Most people don't care if you're telling them the truth or if you're telling them a lie, as long as they're entertained by it.", "author": "Tom Waits"},
{"quote":"Truth isn't always beauty, but the hunger for it is.", "author": "Nadine Gordimer"},
{"quote":"No matter how difficult and painful it may be, nothing sounds as good to the soul as the truth.", "author": "Martha Beck"},
{"quote":"It does not require great learning to be a Christian and be convinced of the truth of the Bible. It requires only an honest heart and a willingness to obey God.", "author": "Albert Barnes"},
{"quote":"It is a clear truth that those who every day barter away other men's liberty will soon care little for their own.", "author": "James Otis"},
{"quote":"If you tell the truth about how you're feeling, it becomes funny.", "author": "Larry David"},
{"quote":"If the individual, or heretic, gets hold of some essential truth, or sees some error in the system being practiced, he commits so many marginal errors himself that he is worn out before he can establish his point.", "author": "Ezra Pound"},
{"quote":"Country music is three chords and the truth.", "author": "Harlan Howard"},
{"quote":"It is a great mystery that though the human heart longs for Truth, in which alone it finds liberation and delight, the first reaction of human beings to Truth is one of hostility and fear!", "author": "Anthony de Mello"},
{"quote":"The remedy for speech that is false is speech that is true. This is the ordinary course in a free society. The response to the unreasoned is the rational; to the uninformed, the enlightened; to the straight-out lie, the simple truth.", "author": "Anthony Kennedy"},
{"quote":"I think heterosexuality and homosexuality are a kind of psychosis, and the truth is somewhere in the middle.", "author": "Jeanette Winterson"},
{"quote":"When there are multiple versions of a story, you really have three ways to go. You can pick the most sensational version. You can try to balance things in your gut to get to what you think is the honest truth. Or you can err on the side of kindness.", "author": "Walter Isaacson"},
{"quote":"The truth is my love life has been a lot more turbulent than I have let on.", "author": "George Michael"},
{"quote":"I feel like it's my responsibility and my obligation to stand up and to say that which I believe to be the truth.", "author": "Jimmy Swaggart"},
{"quote":"It takes a long time to learn that a courtroom is the last place in the world for learning the truth.", "author": "Alice Koller"},
{"quote":"Marriage, if one will face the truth, is an evil, but a necessary evil.", "author": "Menander"},
{"quote":"Being a leader for me is about having the courage to speak the truth, and live the truth, despite attempts to silence our thoughts, feelings, and past experiences.", "author": "Zainab Salbi"},
{"quote":"The end of confession is to tell the truth to and for oneself.", "author": "J. M. Coetzee"},
{"quote":"If readers, young and old, would take even a moment to reflect on our rapidly shifting culture and ideology, I would be happy. Many leaders of the older generation dismiss emerging culture. Those leaders are at risk of becoming a feeble voice-piece without followers. Most of the younger generation is going deaf to the truth.", "author": "Ted Dekker"},
{"quote":"Let us rise in the moral power of womanhood; and give utterance to the voice of outraged mercy, and insulted justice, and eternal truth, and mighty love and holy freedom.", "author": "Maria Weston Chapman"},
{"quote":"I'll continue to try and balance like a circus act. And I will just fight to always tell the truth. Even if it's difficult.", "author": "Katy Perry"},
{"quote":"Government has never increased the standard of living of one single human being in civilization's history. For some reason that simple truth has evaded everybody.", "author": "Steve Wynn"},
{"quote":"Truth never yet fell dead in the streets; it has such affinity with the soul of man, the seed however broadcast will catch somewhere and produce its hundredfold.", "author": "Theodore Parker"},
{"quote":"People always love and respect characters who speak the truth, even if the truth hurts.", "author": "David Duchovny"},
{"quote":"I would rather the man who presents something for my consideration subject me to a zephyr of truth and a gentle breeze of responsibility rather than blow me down with a curtain of hot wind.", "author": "Grover Cleveland"},
{"quote":"The truth is that killing innocent people is always wrong - and no argument or excuse, no matter how deeply believed, can ever make it right. No religion on earth condones the killing of innocent people; no faith tradition tolerates the random killing of our brothers and sisters on this earth.", "author": "Feisal Abdul Rauf"},
{"quote":"Christlike communications are expressions of affection and not anger, truth and not fabrication, compassion and not contention, respect and not ridicule, counsel and not criticism, correction and not condemnation. They are spoken with clarity and not with confusion. They may be tender or they may be tough, but they must always be tempered.", "author": "L. Lionel Kendrick"},
{"quote":"An example I often use to illustrate the reality of vanity, is this: look at the peacock; it's beautiful if you look at it from the front. But if you look at it from behind, you discover the truth... Whoever gives in to such self-absorbed vanity has huge misery hiding inside them.", "author": "Pope Francis"},
{"quote":"The thing about black history is that the truth is so much more complex than anything you could make up.", "author": "Henry Louis Gates"},
{"quote":"My religion is based on truth and non-violence. Truth is my God. Non-violence is the means of realising Him.", "author": "Mahatma Gandhi"},
{"quote":"Happiness is spiritual, born of truth and love. It is unselfish; therefore it cannot exist alone, but requires all mankind to share it.", "author": "Mary Baker Eddy"},
{"quote":"The bud of victory is always in the truth.", "author": "Benjamin Harrison"},
{"quote":"Non-violence and truth are inseparable and presuppose one another.", "author": "Mahatma Gandhi"},
{"quote":"Strike an average between what a woman thinks of her husband a month before she marries him and what she thinks of him a year afterward, and you will have the truth about him.", "author": "H. L. Mencken"},
{"quote":"That which is false troubles the heart, but truth brings joyous tranquillity.", "author": "Rumi"},
{"quote":"Science moves with the spirit of an adventure characterized both by youthful arrogance and by the belief that the truth, once found, would be simple as well as pretty.", "author": "James D. Watson"},
{"quote":"They say death and taxes are the only things that are inevitable. The truth is, you can not pay your taxes. I've done it, and there's consequences, but it can be done. Death you're not going to get out of, and you kind of got to deal with it.", "author": "Steve Earle"},
{"quote":"The greatest truth is honesty, and the greatest falsehood is dishonesty.", "author": "Abu Bakr"},
{"quote":"Pain reaches the heart with electrical speed, but truth moves to the heart as slowly as a glacier.", "author": "Barbara Kingsolver"},
{"quote":"We too often bind ourselves by authorities rather than by the truth.", "author": "Lucretia Mott"},
{"quote":"The first step toward finding God, Who is Truth, is to discover the truth about myself: and if I have been in error, this first step to truth is the discovery of my error.", "author": "Thomas Merton"},
{"quote":"When we believe in lies, we cannot see the truth, so we make thousands of assumptions and we take them as truth. One of the biggest assumptions we make is that the lies we believe are the truth!", "author": "Miguel Angel Ruiz"},
{"quote":"There's just some magic in truth and honesty and openness.", "author": "Frank Ocean"},
{"quote":"I perceived how that it was impossible to establish the lay people in any truth except the Scripture were plainly laid before their eyes in their mother tongue.", "author": "William Tyndale"},
{"quote":"If you're thinking of coming to America, this is what it's like: you've got your Comfort Inn, you've got your Best Western, and you've got your Red Lobster where you eat. Everybody's very fat, everybody's very stupid and everybody's very rude - it's not a holiday programme, it's the truth.", "author": "Jeremy Clarkson"},
{"quote":"During a large disaster, like Hurricane Katrina, warnings get hopelessly jumbled. The truth is that, for warnings to work, it's not enough for them to be delivered. They must also overcome that human tendency to pause; they must trigger a series of effective actions, mobilizing the informal networks that we depend on in a crisis.", "author": "Gary Wolf"},
{"quote":"I am sorry to think that you do not get a man's most effective criticism until you provoke him. Severe truth is expressed with some bitterness.", "author": "Henry David Thoreau"},
{"quote":"It's a deep and all but certain truth about narcissistic personalities that to meet them is to love them, but to know them well is to find them unbearable. Confidence quickly curdles into arrogance; smarts turn to smugness, charm turns to smarm.", "author": "Jeffrey Kluger"},
{"quote":"Humans believe so many lies because we aren't aware. We ignore the truth or we just don't see the truth. When we are educated, we accumulate a lot of knowledge, and all that knowledge is just like a wall of fog that doesn't allow us to perceive the truth, what really is.", "author": "Miguel Angel Ruiz"},
{"quote":"Competence, like truth, beauty, and contact lenses, is in the eye of the beholder.", "author": "Laurence J. Peter"},
{"quote":"Photography is truth. The cinema is truth twenty-four times per second.", "author": "Jean-Luc Godard"},
{"quote":"If there is no criticism, you become lazy. But it should be constructive, and it should be the truth. If it's biased and there's no truth in it, then I don't care about it. If it's true, it helps me grow.", "author": "A. R. Rahman"},
{"quote":"When I tell the truth, it is not for the sake of convincing those who do not know it, but for the sake of defending those that do.", "author": "William Blake"},
{"quote":"Seldom, very seldom, does complete truth belong to any human disclosure; seldom can it happen that something is not a little disguised, or a little mistaken.", "author": "Jane Austen"},
{"quote":"Everyone who knows me will know the truth, which is that my children come first in my life and that I would never harm any child.", "author": "Michael Jackson"},
{"quote":"It is by doubting that we come to investigate, and by investigating that we recognize the truth.", "author": "Peter Abelard"},
{"quote":"If Christians will obey the instructions given to them by Christ and his inspired apostles, they will adorn the religion of the Bible, and save themselves much perplexity and severe trials, which they attribute to their afflictions in consequence of believing unpopular truth.", "author": "Ellen G. White"},
{"quote":"Truth in philosophy means that concept and external reality correspond.", "author": "Georg Wilhelm Friedrich Hegel"},
{"quote":"The art of storytelling is reaching its end because the epic side of truth, wisdom, is dying out.", "author": "Walter Benjamin"},
{"quote":"Even the acceptance of personal responsibility may not overcome the temptation to believe that now is not the time to repent. 'Now' can seem so difficult, and 'later' appear so much easier. The truth is that today is always a better day to repent than any tomorrow.", "author": "Henry B. Eyring"},
{"quote":"The whole point of the kingdom of God is Jesus has come to bear witness to the true truth, which is nonviolent. When God wants to take charge of the world, he doesn't send in the tanks. He sends in the poor and the meek.", "author": "N. T. Wright"},
{"quote":"We cannot forever hide the truth about ourselves, from ourselves.", "author": "John McCain"},
{"quote":"Time is money says the proverb, but turn it around and you get a precious truth. Money is time.", "author": "George Gissing"},
{"quote":"Remember the sufferings of Christ, the storms that were weathered... the crown that came from those sufferings which gave new radiance to the faith... All saints give testimony to the truth that without real effort, no one ever wins the crown.", "author": "Thomas Becket"},
{"quote":"The People have a right to the Truth as they have a right to life, liberty and the pursuit of happiness.", "author": "Frank Norris"},
{"quote":"Piety requires us to honor truth above our friends.", "author": "Aristotle"},
{"quote":"Not when truth is dirty, but when it is shallow, does the enlightened man dislike to wade into its waters.", "author": "Friedrich Nietzsche"},
{"quote":"It takes two to speak the truth: one to speak, and another to hear.", "author": "Henry David Thoreau"},
{"quote":"If truth is beauty, how come no one has their hair done in the library?", "author": "Lily Tomlin"},
{"quote":"When people talk, they lay lines on each other, do a lot of role playing, sidestep, shilly-shally and engage in all manner of vagueness and innuendo. We do this and expect others to do it, yet at the same time we profess to long for the plain truth, for people to say what they mean, simple as that. Such hypocrisy is a human universal.", "author": "Steven Pinker"},
{"quote":"One must be very particular about telling the truth. Through truth one can realize God.", "author": "Ramakrishna"},
{"quote":"To tell the truth is to become beautiful, to begin to love yourself, value yourself. And that's political, in its most profound way.", "author": "June Jordan"},
{"quote":"It is proof of a base and low mind for one to wish to think with the masses or majority, merely because the majority is the majority. Truth does not change because it is, or is not, believed by a majority of the people.", "author": "Giordano Bruno"},
{"quote":"The lowest form of popular culture - lack of information, misinformation, disinformation, and a contempt for the truth or the reality of most people's lives - has overrun real journalism. Today, ordinary Americans are being stuffed with garbage.", "author": "Carl Bernstein"},
{"quote":"Only when we realize that there is no eternal, unchanging truth or absolute truth can we arouse in ourselves a sense of intellectual responsibility.", "author": "Hu Shih"},
{"quote":"Who is God? Who are we? What is our purpose? All these questions remain unanswered. I want to reach the genuine seeker of spiritual well-being. My goal is to satisfy the hunger and longing for those who are seeking the truth.", "author": "Ravi Zacharias"},
{"quote":"The truth is that entrepreneurship is more like a roller coaster ride than a cruise.", "author": "Vivek Wadhwa"},
{"quote":"There can be no democracy without truth. There can be no truth without controversy, there can be no change without freedom. Without freedom there can be no progress.", "author": "Andrew Young"},
{"quote":"I'm looking for the truth. The audience doesn't come to see you, they come to see themselves.", "author": "Julianne Moore"},
{"quote":"At its best, fiction cultivates fantasy and compassion; at its worst, memoir provokes schadenfreude and prurience. The ugly truth, I fear, is that many people are drawn to sensational memoirs for the same reason they watch 'The Apprentice': they like to witness actual suffering, before-your-very-eyes humiliation.", "author": "Julia Glass"},
{"quote":"The object of the superior man is truth.", "author": "Confucius"},
{"quote":"How can sincerity be a condition of friendship? A taste for truth at any cost is a passion which spares nothing.", "author": "Albert Camus"},
{"quote":"Only the broken-hearted know the truth about love.", "author": "Mason Cooley"},
{"quote":"A lot of people are afraid to tell the truth, to say no. That's where toughness comes into play. Toughness is not being a bully. It's having backbone.", "author": "Robert Kiyosaki"},
{"quote":"Any fool knows that bravado is always a cover-up for insecurity. That's the truth. And on that note, I'll say goodnight. God love you.", "author": "Bobby Darin"},
{"quote":"Marilyn Monroe wasn't even her real name, Charles Manson isn't his real name, and now, I'm taking that to be my real name. But what's real? You can't find the truth, you just pick the lie you like the best.", "author": "Marilyn Manson"},
{"quote":"I went into the business for the money, and the art grew out of it. If people are disillusioned by that remark, I can't help it. It's the truth.", "author": "Charlie Chaplin"},
{"quote":"Always speak the truth, think before you speak, and write it down afterwards.", "author": "Lewis Carroll"},
{"quote":"President Barack Obama has stood watch over the greatest job loss in modern American history. And that, my friends, is one inconvenient truth that will haunt this President throughout history.", "author": "Mitt Romney"},
{"quote":"I can prove anything by statistics except the truth.", "author": "George Canning"},
{"quote":"Truth will rise above falsehood as oil above water.", "author": "Miguel de Cervantes"},
{"quote":"The truth is, I often like women. I like their unconventionality. I like their completeness. I like their anonymity.", "author": "Virginia Woolf"},
{"quote":"Real intimacy depends on truth - lovingly told - especially in the bedroom.", "author": "Joyce Brothers"},
{"quote":"Elections, for their part, are typically popularity contests rather than measures of candidates' relative competency or effectiveness. Imagine if scientific truth were determined according to which scientist was most popular. To be successful, scientists would have to be charismatic and attractive - and human knowledge would suffer terribly.", "author": "Nathan Myhrvold"},
{"quote":"I'm not a tough guy. I'm just delivering the truth and only the truth and if you can't deal with it, too bad.", "author": "Kevin O'Leary"},
{"quote":"Now, today is the day we honor, of course, the Presidents, ranging from George Washington, who couldn't tell a lie, to George Bush, who couldn't tell the truth, to Bill Clinton, who couldn't tell the difference.", "author": "Jay Leno"},
{"quote":"Telling the truth to people who misunderstand you is generally promoting a falsehood, isn't it?", "author": "Anthony Hope"},
{"quote":"Art is nothing but the expression of our dream; the more we surrender to it the closer we get to the inner truth of things, our dream-life, the true life that scorns questions and does not see them.", "author": "Franz Marc"},
{"quote":"There are no captions on red-carpet photos that say, 'This girl trained for two weeks, she went on a juice diet, she has a professional hair and makeup person, and this dress was made for her.' I just wish they'd say, 'It ain't the truth.'", "author": "Emilia Clarke"},
{"quote":"I am a humble but very earnest seeker after truth.", "author": "Mahatma Gandhi"},
{"quote":"In the consciousness of the truth he has perceived, man now sees everywhere only the awfulness or the absurdity of existence and loathing seizes him.", "author": "Friedrich Nietzsche"},
{"quote":"Art is a lie that makes us realize truth.", "author": "Pablo Picasso"},
{"quote":"No one can be happy who has been thrust outside the pale of truth. And there are two ways that one can be removed from this realm: by lying, or by being lied to.", "author": "Lucius Annaeus Seneca"},
{"quote":"The truth is found when men are free to pursue it.", "author": "Franklin D. Roosevelt"},
{"quote":"The very concept of objective truth is fading out of the world. Lies will pass into history.", "author": "George Orwell"},
{"quote":"There is nothing so strong or safe in an emergency of life as the simple truth.", "author": "Charles Dickens"},
{"quote":"Mistakes are, after all, the foundations of truth, and if a man does not know what a thing is, it is at least an increase in knowledge if he knows what it is not.", "author": "Carl Jung"},
{"quote":"The truth is that life is delicious, horrible, charming, frightful, sweet, bitter, and that is everything.", "author": "Anatole France"},
{"quote":"Getting rid of a delusion makes us wiser than getting hold of a truth.", "author": "Ludwig Borne"},
{"quote":"If the truth contradicts deeply held beliefs, that is too bad.", "author": "Hans Eysenck"},
{"quote":"You can hate me. You can go out there and say anything you want about me, But you will love me later because I told you the truth.", "author": "Mary J. Blige"},
{"quote":"The color of truth is gray.", "author": "Andre Gide"},
{"quote":"To have the truth in your possession you can be found guilty, sentenced to death.", "author": "Peter Tosh"},
{"quote":"Truth springs from argument amongst friends.", "author": "David Hume"},
{"quote":"The Bible must be considered as the great source of all the truth by which men are to be guided in government as well as in all social transactions.", "author": "Noah Webster"},
{"quote":"The sad truth is that the civil rights movement cannot be reborn until we identify the causes of black suffering, some of them self-inflicted. Why can't black leaders organize rallies around responsible sexuality, birth within marriage, parents reading to their children and students staying in school and doing homework?", "author": "Henry Louis Gates"},
{"quote":"Architecture is the reaching out for the truth.", "author": "Louis Kahn"},
{"quote":"Mom spent the time that she was supposed to be a kid actully raising children, her younger brother and younger sister. She was tough as nails and did not suffer fools at all. And the truth was she could not afford to. She spoke the truth, bluntly, directly, and without much varnish. I am her son.", "author": "Chris Christie"},
{"quote":"When a scientist is ahead of his times, it is often through misunderstanding of current, rather than intuition of future truth. In science there is never any error so gross that it won't one day, from some perspective, appear prophetic.", "author": "Jean Rostand"},
{"quote":"Both need each other: The agnostic cannot be content to not know, but must be in search of the great truth of faith; the Catholic cannot be content to have faith, but must be in search of God all the time, and in the dialogue with others, a Catholic can learn more about God in a deeper fashion.", "author": "Pope Benedict XVI"},
{"quote":"Metaphors have a way of holding the most truth in the least space.", "author": "Orson Scott Card"},
{"quote":"It is not the truth that a man possesses, or believes that he possesses, but the earnest effort which he puts forward to reach the truth, which constitutes the worth of a man.", "author": "Gotthold Ephraim Lessing"},
{"quote":"The earth is such a voluminous, sparse, wild place that has its own rhythm that human beings try to control and strategize our way around, but the truth is, if you're out someplace like the ocean on a capsized boat, it doesn't matter if you have academic degrees, or if you're a martial-arts ninja. Nature is a bigger force than you.", "author": "Rachael Taylor"},
{"quote":"At a certain point, I felt the need to submit to a higher level of religiosity... to move away from my intuition and to accept an ultimate truth. I felt that in order to become a good person, I needed rules - lots of them - or else I would somehow fall apart. I am reclaiming myself. Trusting my goodness and my divine mission.", "author": "Matisyahu"},
{"quote":"The pharmaceutical industry likes to depict itself as a research-based industry, as the source of innovative drugs. Nothing could be further from the truth. This is their incredible PR and their nerve.", "author": "Marcia Angell"},
{"quote":"Mystical explanations are thought to be deep; the truth is that they are not even shallow.", "author": "Friedrich Nietzsche"},
{"quote":"The truth is, in order to get things like universal health care and a revamped education system, then someone is going to have to give up a piece of their pie so that someone else can have more.", "author": "Michelle Obama"},
{"quote":"It is error only, and not truth, that shrinks from inquiry.", "author": "Thomas Paine"},
{"quote":"The truth is a snare: you cannot have it, without being caught. You cannot have the truth in such a way that you catch it, but only in such a way that it catches you.", "author": "Soren Kierkegaard"},
{"quote":"We've used up a lot of bullets. And we talk about stimulus. But the truth is, we're running a federal deficit that's 9 percent of GDP. That is stimulative as all get out. It's more stimulative than any policy we've followed since World War II.", "author": "Warren Buffett"},
{"quote":"Any truth is better than indefinite doubt.", "author": "Arthur Conan Doyle"},
{"quote":"He that takes truth for his guide, and duty for his end, may safely trust to God's providence to lead him aright.", "author": "Blaise Pascal"},
{"quote":"Mental fight means thinking against the current, not with it. It is our business to puncture gas bags and discover the seeds of truth.", "author": "Virginia Woolf"},
{"quote":"Doubt, indulged and cherished, is in danger of becoming denial; but if honest, and bent on thorough investigation, it may soon lead to full establishment of the truth.", "author": "Ambrose Bierce"},
{"quote":"There are only two things. Truth and lies. Truth is indivisible, hence it cannot recognize itself; anyone who wants to recognize it has to be a lie.", "author": "Franz Kafka"},
{"quote":"It seems a fantastic paradox, but it is nevertheless a most important truth, that no architecture can be truly noble which is not imperfect.", "author": "John Ruskin"},
{"quote":"There is not one single police officer in America that I am not afraid of and not one that I would trust to tell the truth or obey the laws they are sworn to uphold. I do not believe they protect me in any way.", "author": "Henry Rollins"},
{"quote":"Do not love leisure. Waste not a minute. Be bold. Realize the Truth, here and now!", "author": "Swami Sivananda"},
{"quote":"As a small businessperson, you have no greater leverage than the truth.", "author": "John Greenleaf Whittier"},
{"quote":"Dispassionate objectivity is itself a passion, for the real and for the truth.", "author": "Abraham Maslow"},
{"quote":"Bad taste is simply saying the truth before it should be said.", "author": "Mel Brooks"},
{"quote":"I think 80 percent of the population are really great, caring people who will help you and tell you the truth. That's just the way it is. And I think 20 percent of the population are crooks and liars. It's just a fact.", "author": "Tom Hanks"},
{"quote":"I've been & am absurdly over-estimated. There are no supermen & I'm quite ordinary, & will say so whatever the artistic results. In that point I'm one of the few people who tell the truth about myself.", "author": "T. E. Lawrence"},
{"quote":"The truth is often a terrible weapon of aggression. It is possible to lie, and even to murder, with the truth.", "author": "Alfred Adler"},
{"quote":"The poet is a liar who always speaks the truth.", "author": "Jean Cocteau"},
{"quote":"Justice is rather the activity of truth, than a virtue in itself. Truth tells us what is due to others, and justice renders that due. Injustice is acting a lie.", "author": "Horace Walpole"},
{"quote":"But now I have come to believe that the whole world is an enigma, a harmless enigma that is made terrible by our own mad attempt to interpret it as though it had an underlying truth.", "author": "Umberto Eco"},
{"quote":"The truth is that since childhood I had cultivated an existential independence. It came from perceiving the adults around me as unreliable, and without it I felt I wouldn't have survived. I cared deeply for everyone in my family, but in the end I depended on myself.", "author": "Sonia Sotomayor"},
{"quote":"The universal medicine for the Soul is the Supreme Reason and Absolute Justice; for the mind, mathematical and practical Truth; for the body, the Quintessence, a combination of light and gold.", "author": "Albert Pike"},
{"quote":"A memoir forces me to stop and remember carefully. It is an exercise in truth. In a memoir, I look at myself, my life, and the people I love the most in the mirror of the blank screen. In a memoir, feelings are more important than facts, and to write honestly, I have to confront my demons.", "author": "Isabel Allende"},
{"quote":"I am aware that a philosopher's ideas are not subject to the judgment of ordinary persons, because it is his endeavour to seek the truth in all things, to the extent permitted to human reason by God.", "author": "Nicolaus Copernicus"},
{"quote":"Everything will line up perfectly when knowing and living the truth becomes more important than looking good.", "author": "Alan Cohen"},
{"quote":"The spirit of truth and the spirit of freedom - these are the pillars of society.", "author": "Henrik Ibsen"},
{"quote":"These years in silence and reflection made me stronger and reminded me that acceptance has to come from within and that this kind of truth gives me the power to conquer emotions I didn't even know existed.", "author": "Ricky Martin"},
{"quote":"The first casualty when war comes is truth.", "author": "Hiram Johnson"},
{"quote":"The influence of 'Hidden Fortress' comes up a lot because it was printed in a book once. The truth is, the only thing I was inspired by was the fact that it's told from the point of view of two peasants, who get mixed up with a samurai and princess and a lot of very high-level people.", "author": "George Lucas"},
{"quote":"Scientists search for truth. Philosophers search for morality. A criminal trial searches for only one result: proof beyond a reasonable doubt.", "author": "Alan Dershowitz"},
{"quote":"The clearest actions come from truth, not obligation.", "author": "Gerard Way"},
{"quote":"Everybody has a Big Momma: the mother or the grandmother who tells it like it is, keeps it real with them, isn't afraid to tell you the truth about yourself.", "author": "Martin Lawrence"},
{"quote":"Leaders know the importance of having someone in their lives who will unfailingly and fearlessly tell them the truth.", "author": "Warren Bennis"},
{"quote":"I like to joke that I probably hold the world record for rejection letters. Yes, the truth is that I was fed up of being rejected repeatedly, and self-publication was an act of defiance at traditional publishing. But life works in strange ways.", "author": "Ashwin Sanghi"},
{"quote":"There is no teacher, living or past, who can give us the actual understanding of Truth. A teacher can only put our feet upon the path and point the way. That is all. It is wholly dependent on the individual to make his way to Truth.", "author": "Paul Twitchell"},
{"quote":"I've worked for 55 years. I'm going to take a little time off, to tell you the truth. It's just that now in the last couple of weeks, Gelman is pouring it on. 'Farewell to Regis!' It's getting embarrassing.", "author": "Regis Philbin"},
{"quote":"You never monkey with the truth.", "author": "Ben Bradlee"},
{"quote":"Go to the truth beyond the mind. Love is the bridge.", "author": "Stephen Levine"},
{"quote":"Barack Obama would not be President if he were dark skin. You know what I mean? That's just the truth. I might not be as successful as I am now if I was dark skin.", "author": "J. Cole"},
{"quote":"You can't legislate into existence an act of forgiveness and a true confession; those are mysteries of the human heart, and they occur between one individual and another individual, not a panel of judges sitting asking questions, trying to test your truth.", "author": "Athol Fugard"},
{"quote":"The intellectual power is never at rest; it is never satisfied with any comprehended truth, but ever proceeds on and on towards that truth which is not comprehended. So also the will, which follows the apprehension; we see that it is never satisfied with anything finite.", "author": "Giordano Bruno"},
{"quote":"Pirates are the very essence of profit maximising entrepreneurs described in neoclassical economics. Yet, whilst films such as 'The Pirates of the Caribbean' and 'Butch Cassidy and the Sundance Kid' have gone a long way to popularise both pirates and outlaw behaviour, the truth of the matter is that piracy is illegal, and it kills.", "author": "Peter Middlebrook"},
{"quote":"You cannot 'rationalize' what is not rational to begin with - as if lying were called 'truthization.' There is no way to obtain more truth for a proposition by bribery, flattery, or the most passionate argument - you can make more people believe the proposition, but you cannot make it more true.", "author": "Eliezer Yudkowsky"},
{"quote":"Keep in mind that when public figures get in trouble for something they said, it is usually not because they misspoke, but because they accidentally told the truth.", "author": "David Carr"},
{"quote":"Many a doctrine is like a window pane. We see truth through it but it divides us from truth.", "author": "Khalil Gibran"},
{"quote":"In truth, politeness is artificial good humor, it covers the natural want of it, and ends by rendering habitual a substitute nearly equivalent to the real virtue.", "author": "Thomas Jefferson"},
{"quote":"The rarest quality in an epitaph is truth.", "author": "Henry David Thoreau"},
{"quote":"Truth is mysterious, elusive, always to be conquered. Liberty is dangerous, as hard to live with as it is elating. We must march toward these two goals, painfully but resolutely, certain in advance of our failings on so long a road.", "author": "Albert Camus"},
{"quote":"The truth is, sex doesn't mean that much to me now.", "author": "Lana Turner"},
{"quote":"If you shut the door to all errors, truth will be shut out.", "author": "Rabindranath Tagore"},
{"quote":"Truth is weirder than any fiction I've seen.", "author": "Hunter S. Thompson"},
{"quote":"First and last, what is demanded of genius is love of truth.", "author": "Johann Wolfgang von Goethe"},
{"quote":"Opinions are made to be changed - or how is truth to be got at?", "author": "Lord Byron"},
{"quote":"It was one of those evenings when men feel that truth, goodness and beauty are one. In the morning, when they commit their discovery to paper, when others read it written there, it looks wholly ridiculous.", "author": "Aldous Huxley"},
{"quote":"It is a universal truth that the loss of liberty at home is to be charged to the provisions against danger, real or pretended, from abroad.", "author": "James Madison"},
{"quote":"Everything deep is also simple and can be reproduced simply as long as its reference to the whole truth is maintained. But what matters is not what is witty but what is true.", "author": "Albert Schweitzer"},
{"quote":"When you're caught up in the storm or, you know, just the turmoil of everything that there is another side and you do get through it. And you know, just standing by the truth and doing the right thing.", "author": "Amber Frey"},
{"quote":"Whoever is detected in a shameful fraud is ever after not believed even if they speak the truth.", "author": "Phaedrus"},
{"quote":"For truth is always strange; stranger than fiction.", "author": "Lord Byron"},
{"quote":"Truth is always strange, stranger than fiction.", "author": "Lord Byron"},
{"quote":"Be calm in arguing; for fierceness makes error a fault, and truth discourtesy.", "author": "George Herbert"},
{"quote":"Your problem is how you are going to spend this one odd and precious life you have been issued. Whether you're going to spend it trying to look good and creating the illusion that you have power over people and circumstances, or whether you are going to taste it, enjoy it and find out the truth about who you are.", "author": "Anne Lamott"},
{"quote":"If you do not tell the truth about yourself you cannot tell it about other people.", "author": "Virginia Woolf"},
{"quote":"It is always the best policy to speak the truth, unless, of course, you are an exceptionally good liar.", "author": "Jerome K. Jerome"},
{"quote":"All fixed set patterns are incapable of adaptability or pliability. The truth is outside of all fixed patterns.", "author": "Bruce Lee"},
{"quote":"There's a world of difference between truth and facts. Facts can obscure the truth.", "author": "Maya Angelou"},
{"quote":"Light is the symbol of truth.", "author": "James Russell Lowell"},
{"quote":"Truth is stranger than fiction, but it is because Fiction is obliged to stick to possibilities; Truth isn't.", "author": "Mark Twain"},
{"quote":"The truth is rarely pure and never simple.", "author": "Oscar Wilde"},
{"quote":"I believe that unarmed truth and unconditional love will have the final word in reality. This is why right, temporarily defeated, is stronger than evil triumphant.", "author": "Martin Luther King, Jr."},
{"quote":"There are only two people who can tell you the truth about yourself - an enemy who has lost his temper and a friend who loves you dearly.", "author": "Antisthenes"},
{"quote":"Hard times arouse an instinctive desire for authenticity.", "author": "Coco Chanel"},
{"quote":"Facts are stubborn things.", "author": "Ronald Reagan"},
{"quote":"When in doubt tell the truth.", "author": "Mark Twain"},
{"quote":"Tell the truth, but tell it slant.", "author": "Emily Dickinson"},
{"quote":"I am a firm believer in the people. If given the truth, they can be depended upon to meet any national crisis. The great point is to bring them the real facts.", "author": "Abraham Lincoln"},
{"quote":"Truth is a deep kindness that teaches us to be content in our everyday life and share with the people the same happiness.", "author": "Khalil Gibran"},
{"quote":"A truth that's told with bad intent beats all the lies you can invent.", "author": "William Blake"},
{"quote":"Adversity is the first path to truth.", "author": "Lord Byron"},
{"quote":"I have a theory that the truth is never told during the nine-to-five hours.", "author": "Hunter S. Thompson"},
{"quote":"Truth is strong, and sometime or other will prevail.", "author": "Mary Astell"},
{"quote":"Fear is not in the habit of speaking truth; when perfect sincerity is expected, perfect freedom must be allowed; nor has anyone who is apt to be angry when he hears the truth any cause to wonder that he does not hear it.", "author": "Tacitus"},
{"quote":"Perhaps the truth depends on a walk around the lake.", "author": "Wallace Stevens"},
{"quote":"Half a truth is often a great lie.", "author": "Benjamin Franklin"},
{"quote":"Reason is the natural order of truth; but imagination is the organ of meaning.", "author": "C. S. Lewis"},
{"quote":"People will generally accept facts as truth only if the facts agree with what they already believe.", "author": "Andy Rooney"},
{"quote":"Three chords and the truth - that's what a country song is.", "author": "Willie Nelson"},
{"quote":"I think there ought to be a club in which preachers and journalists could come together and have the sentimentalism of the one matched with the cynicism of the other. That ought to bring them pretty close to the truth.", "author": "Reinhold Niebuhr"},
{"quote":"I pefer an ugly truth to a pretty lie. If someone is telling me the truth that is when I will give my heart.", "author": "Shakira"},
{"quote":"The truth may be out there, but lies are inside your head.", "author": "Terry Pratchett"},
{"quote":"When I saw corruption, I was forced to find truth on my own. I couldn't swallow the hypocrisy.", "author": "Barry White"},
{"quote":"A rusty nail placed near a faithful compass, will sway it from the truth, and wreck the argosy.", "author": "Walter Scott"},
{"quote":"Power is domination, control, and therefore a very selective form of truth which is a lie.", "author": "Wole Soyinka"},
{"quote":"The man who cannot endure to have his errors and shortcomings brought to the surface and made known, but tries to hide them, is unfit to walk the highway of truth.", "author": "James Allen"},
{"quote":"Young people are just as attracted to the truth as they are convenience and expediency.", "author": "Pope Francis"},
{"quote":"We live in a world of denial, and we don't know what the truth is anymore.", "author": "Javier Bardem"},
{"quote":"Most people live in a myth and grow violently angry if anyone dares to tell them the truth about themselves.", "author": "Robert Anton Wilson"},
{"quote":"Truth is exact correspondence with reality.", "author": "Paramahansa Yogananda"},
{"quote":"Let's not be afraid to speak the common sense truth: you can't have high standards without good discipline.", "author": "William Hague"},
{"quote":"Myth and fairy-story must, as all art, reflect and contain in solution elements of moral and religious truth (or error), but not explicit, not in the known form of the primary 'real' world.", "author": "J. R. R. Tolkien"},
{"quote":"A lie would have no sense unless the truth were felt dangerous.", "author": "Alfred Adler"},
{"quote":"Biggest lesson I learned my first year in the NFL is no one gives a crap about what you did last week. This league is about what have you done for me now. That's the NFL. It's also our culture. So you keep working hard because that's the biggest truth about football.", "author": "Andrew Luck"},
{"quote":"The belief that there is only one truth, and that oneself is in possession of it, is the root of all evil in the world.", "author": "Max Born"},
{"quote":"Prayer is the spirit speaking truth to Truth.", "author": "Philip James Bailey"},
{"quote":"God help us from those who believe that they are the sole possessors of truth. How we manage at times to agree willingly to become prisoners within our own minds and souls of beliefs and ideas on which we can never be flexible.", "author": "King Hussein I"},
{"quote":"No human being is constituted to know the truth, the whole truth, and nothing but the truth; and even the best of men must be content with fragments, with partial glimpses, never the full fruition.", "author": "William Osler"},
{"quote":"My idea of a delicious time is to read a book that is wonderful. But the ruling passion of my life is being a seeker after truth and the divine.", "author": "bell hooks"},
{"quote":"Truth never comes into the world but like a bastard, to the ignominy of him that brought her birth.", "author": "John Milton"},
{"quote":"We cannot know the whole truth, which belongs to God alone, but our task nevertheless is to seek to know what is true. And if we offend gravely enough against what we know to be true, as by failing badly enough to deal affectionately and responsibly with our land and our neighbors, truth will retaliate with ugliness, poverty, and disease.", "author": "Wendell Berry"},
{"quote":"If now isn't a good time for the truth I don't see when we'll get to it.", "author": "Nikki Giovanni"},
{"quote":"Never wear your best trousers when you go out to fight for freedom and truth.", "author": "Henrik Ibsen"},
{"quote":"Trust your gut feeling about things, listen to what others are saying, and look at the results of your actions. Once you know the truth, you can set about taking action to improve. Everyone will be better for it.", "author": "Jack Canfield"},
{"quote":"Don't try to tear down other people's religion about their ears, Build up your own perfect structure of truth, and invite your listeners to enter in and enjoy it's glories.", "author": "Brigham Young"},
{"quote":"I find being funny very hard work. I am always asked about it, and I feel guilty saying that, but it's the truth. I love my work, but it ain't easy.", "author": "Madeline Kahn"},
{"quote":"She gave up beauty in her tender youth, gave all her hope and joy and pleasant ways; she covered up her eyes lest they should gaze on vanity, and chose the bitter truth.", "author": "Christina Rossetti"},
{"quote":"I am in the present. I cannot know what tomorrow will bring forth. I can know only what the truth is for me today. That is what I am called upon to serve, and I serve it in all lucidity.", "author": "Igor Stravinsky"},
{"quote":"If we were to abandon concern for what is true, what is false, and what remains indeterminate, the world would be totally chaotic. Even those who deny the importance of truth, on the one hand, are quick to jump on anyone who is caught lying.", "author": "Howard Gardner"},
{"quote":"A lot of people in the media, and some everyday people, really aren't in search of the truth. They're in search of something worse than that. Money, yeah. I think the media's the kind of a thing where the truth doesn't win, because it's no fun. The truth's no fun.", "author": "Jack White"},
{"quote":"We've had a major shift in what truth is and where it comes from. We've gone from being God-centered to self-centered, from being objective to being subjective, and from being internal to external.", "author": "Josh McDowell"},
{"quote":"Vagueness is at times an indication of nearness to a perfect truth.", "author": "Charles Ives"},
{"quote":"I never told a victim story about my imprisonment. Instead, I told a transformation story - about how prison changed my outlook, about how I saw that communication, truth, and trust are at the heart of power.", "author": "Fernando Flores"},
{"quote":"Liberated from the error of pagan tradition through the benevolence and loving kindness of the good God with the grace of our Lord Jesus Christ, and by the operation of the Holy Spirit, I was reared from the very beginning by Christian parents. From them I learned even in babyhood the Holy Scriptures which led me to a knowledge of the truth.", "author": "Saint Basil"},
{"quote":"The truth doesn't change. It was the same when Moses got the Ten Commandments as it is today. That's the thing about the truth. That's the thing about real. It doesn't change and it doesn't have to change. Now you can put it in a different book, but it's still real. It's still the truth.", "author": "DMX"},
{"quote":"Truth is Mormonism. God is the author of it.", "author": "Joseph Smith, Jr."},
{"quote":"We talk about honesty, but the reality is we have lots of human values, and they are not all compatible. We don't always tell the truth about everything, no matter what the consequences.", "author": "Dan Ariely"},
{"quote":"Never question the relevance of truth, but always question the truth of relevance.", "author": "Craig Bruce"},
{"quote":"Seek truth from facts.", "author": "Deng Xiaoping"},
{"quote":"Science is the pursuit of pure truth, and the systematizing of it.", "author": "P. T. Barnum"},
{"quote":"A science is something which is constructed from truth on workable axioms. There are 55 axioms in scientology which are very demonstrably true, and on these can be constructed a great deal.", "author": "L. Ron Hubbard"},
{"quote":"Why waste time trying to discover the truth, when you can so easily create it?", "author": "David Baldacci"},
{"quote":"It seems, by today's standards, that it's better to seek approval than to tell the truth. It's better to utter sweet nothings than to boldly say something of substance.", "author": "Monica Johnson"},
{"quote":"False history gets made all day, any day, the truth of the new is never on the news.", "author": "Adrienne Rich"},
{"quote":"The real issue behind these people who are gun grabbers, the truth is - based on fact - the reason why is, they want control. They want control of the people. That's what socialism is and communism.", "author": "Luke Scott"},
{"quote":"Truth is absolute, truth is supreme, truth is never disposable in national political life.", "author": "John Howard"},
{"quote":"Often times we feel like either we can't make a world of difference, or we feel that it's not going to change anything anyway. The truth is you can change someone's day, you can change someone's life, but you have to show up and do what you got to do to actually see any fruit coming from it.", "author": "Nick Vujicic"},
{"quote":"The second one, the joint Truth and Friendship Commission, which we started now with Indonesia, that is the one that has been criticized; its terms of reference call for providing amnesty for those who cooperate in telling the truth. It does not lead to prosecution.", "author": "Jose Ramos-Horta"},
{"quote":"I believe that truth has only one face: that of a violent contradiction.", "author": "Georges Bataille"},
{"quote":"How sweet the words of Truth, breathed from the lips of Love.", "author": "James Beattie"},
{"quote":"I was born in Hoboken. I am an American. Photography is my passion. The search for Truth my obsession.", "author": "Alfred Stieglitz"},
{"quote":"I am for gay marriage. Or same-sex marriage. I don't want to say it the wrong way. I think people are sensitive to it. I have been painted as being this right-wing zealot on choice. Nothing could be further from the truth.", "author": "Harold Ford, Jr."},
{"quote":"The one thing I have never been afraid of is standing before important people and speaking my mind. I represent women who may never have the opportunity to go to the UN or meet with a president. I'm never afraid to speak truth to power.", "author": "Leymah Gbowee"},
{"quote":"I tend not to dwell on the parallels between chess and business, chess and the martial arts, or any two things for that matter, because the truth is that all pursuits are connected if we gain an eye for the thematic links.", "author": "Joshua Waitzkin"},
{"quote":"Most jokes state a bitter truth.", "author": "Larry Gelbart"},
{"quote":"The truth is, I can't help the way people perceive anything, from the role of financial industry in the economic crisis, to the place of women's fiction in the canon of modern literature, to the rank of mint chocolate chip ice cream as a favorite Baskin-Robbins flavor.", "author": "Erin Duffy"},
{"quote":"For Africa to me... is more than a glamorous fact. It is a historical truth. No man can know where he is going unless he knows exactly where he has been and exactly how he arrived at his present place.", "author": "Maya Angelou"},
{"quote":"All of us knows, not what is expedient, not what is going to make us popular, not what the policy is, or the company policy - but in truth each of us knows what is the right thing to do. And that's how I am guided.", "author": "Maya Angelou"},
{"quote":"I promised myself that I would write as well as I can, tell the truth, not to tell everything I know, but to make sure that everything I tell is true, as I understand it. And to use the eloquence which my language affords me.", "author": "Maya Angelou"},
{"quote":"The truth is that parents are not really interested in justice. They just want quiet.", "author": "Bill Cosby"},
{"quote":"For though we love both the truth and our friends, piety requires us to honor the truth first.", "author": "Aristotle"},
{"quote":"We have art in order not to die of the truth.", "author": "Friedrich Nietzsche"},
{"quote":"Exaggeration is truth that has lost its temper.", "author": "Khalil Gibran"},
{"quote":"All truth is simple... is that not doubly a lie?", "author": "Friedrich Nietzsche"},
{"quote":"The lawyer's truth is not Truth, but consistency or a consistent expediency.", "author": "Henry David Thoreau"},
{"quote":"Expectations are a form of first-class truth: If people believe it, it's true.", "author": "Bill Gates"},
{"quote":"The truth is, hardly any of us have ethical energy enough for more than one really inflexible point of honor.", "author": "George Bernard Shaw"},
{"quote":"Truth is the beginning of every good to the gods, and of every good to man.", "author": "Plato"},
{"quote":"If you ever injected truth into politics you have no politics.", "author": "Will Rogers"},
{"quote":"Wisdom is found only in truth.", "author": "Johann Wolfgang von Goethe"},
{"quote":"I am very fond of truth, but not at all of martyrdom.", "author": "Voltaire"},
{"quote":"Of course it's the same old story. Truth usually is the same old story.", "author": "Margaret Thatcher"},
{"quote":"If you seek truth you will not seek victory by dishonorable means, and if you find truth you will become invincible.", "author": "Epictetus"},
{"quote":"To be outspoken is easy when you do not wait to speak the complete truth.", "author": "Rabindranath Tagore"},
{"quote":"Love is not a mere impulse, it must contain truth, which is law.", "author": "Rabindranath Tagore"},
{"quote":"He who does not bellow the truth when he knows the truth makes himself the accomplice of liars and forgers.", "author": "Charles Peguy"},
{"quote":"Individuals need to be willing to face truth about their attitudes, behaviors, even what we want out of life.", "author": "Joyce Meyer"},
{"quote":"It may not always be easy, convenient, or politically correct to stand for truth and right, but it is the right thing to do. Always.", "author": "M. Russell Ballard"},
{"quote":"The enlightenment is under threat. So is reason. So is truth. So is science, especially in the schools of America.", "author": "Richard Dawkins"},
{"quote":"I wanted to write about the moment when your addictions no longer hide the truth from you. When your whole life breaks down. That's the moment when you have to somehow choose what your life is going to be about.", "author": "Chuck Palahniuk"},
{"quote":"The truth is on the march and nothing will stop it.", "author": "Emile Zola"},
{"quote":"The great quest of life has always been to discover truth.", "author": "Joyce Meyer"},
{"quote":"I think it better that in times like these a poet's mouth be silent, for in truth we have no gift to set a statesman right.", "author": "William Butler Yeats"},
{"quote":"Falsehood has an infinity of combinations, but truth has only one mode of being.", "author": "Jean-Jacques Rousseau"},
{"quote":"It is in our idleness, in our dreams, that the submerged truth sometimes comes to the top.", "author": "Virginia Woolf"},
{"quote":"The truth of our faith becomes a matter of ridicule among the infidels if any Catholic, not gifted with the necessary scientific learning, presents as dogma what scientific scrutiny shows to be false.", "author": "Thomas Aquinas"},
{"quote":"The dreamer can know no truth, not even about his dream, except by awaking out of it.", "author": "George Santayana"},
{"quote":"I think my love of truth and honesty forces me to notice that the liberal intelligentsia of Western countries is betraying itself where Islam is concerned.", "author": "Richard Dawkins"},
{"quote":"Quick condemnation of all that is not ours, of views with which we disagree, of ideas that do not attract us, is the sign of a narrow mind, of an uncultivated intelligence. Bigotry is always ignorant, and the wise boy, who will become the wise man, tries to understand and to see the truth in ideas with which he does not agree.", "author": "Annie Besant"},
{"quote":"Heresies are experiments in man's unsatisfied search for truth.", "author": "H. G. Wells"},
{"quote":"Violence does, in truth, recoil upon the violent, and the schemer falls into the pit which he digs for another.", "author": "Arthur Conan Doyle"},
{"quote":"What does it matter how one comes by the truth so long as one pounces upon it and lives by it?", "author": "Henry Miller"},
{"quote":"I put forward formless and unresolved notions, as do those who publish doubtful questions to debate in the schools, not to establish the truth but to seek it.", "author": "Michel de Montaigne"},
{"quote":"I would rather be uncomfortable with the truth than to be lied to in comfort. That's just my nature.", "author": "Jesse Ventura"},
{"quote":"Intense feeling too often obscures the truth.", "author": "Harry S Truman"},
{"quote":"The world is indeed a mixture of truth and make-believe. Discard the make-believe and take the truth.", "author": "Ramakrishna"},
{"quote":"From principles is derived probability, but truth or certainty is obtained only from facts.", "author": "Tom Stoppard"},
{"quote":"It is a simple but sometimes forgotten truth that the greatest enemy to present joy and high hopes is the cultivation of retrospective bitterness.", "author": "Robert Menzies"},
{"quote":"Hip-hop reflects the truth, and the problem is that hip-hop exposes a lot of the negative truth that society tries to conceal. It's a platform where we could offer information, but it's also an escape.", "author": "Busta Rhymes"},
{"quote":"There are new words now that excuse everybody. Give me the good old days of heroes and villains, the people you can bravo or hiss. There was a truth to them that all the slick credulity of today cannot touch.", "author": "Bette Davis"},
{"quote":"I have come to believe that the whole world is an enigma, a harmless enigma that is made terrible by our own mad attempt to interpret it as though it had an underlying truth.", "author": "Umberto Eco"},
{"quote":"Fixed principles of truth are the only safeguard for youth.", "author": "Ellen G. White"},
{"quote":"The dictum that truth always triumphs over persecution is one of the pleasant falsehoods which men repeat after one another till they pass into commonplaces, but which all experience refutes.", "author": "John Stuart Mill"},
{"quote":"Sometimes I dread the truth of the lines I say. But the dread must never show.", "author": "Vivien Leigh"},
{"quote":"Man has gone long enough, or even too long, without being man enough to face the simple truth that the trouble with man is man.", "author": "James Thurber"},
{"quote":"The American fascists are most easily recognized by their deliberate perversion of truth and fact. Their newspapers and propaganda carefully cultivate every fissure of disunity, every crack in the common front against fascism.", "author": "Henry A. Wallace"},
{"quote":"There is a tragic clash between Truth and the world. Pure undistorted truth burns up the world.", "author": "Nikolai Berdyaev"},
{"quote":"Be truthful, nature only sides with truth.", "author": "Adolf Loos"},
{"quote":"Truth is in things, and not in words.", "author": "Herman Melville"},
{"quote":"The Assembly has witnessed over the last weeks how historical truth is established; once an allegation has been repeated a few times, it is no longer an allegation, it is an established fact, even if no evidence has been brought out in order to support it.", "author": "Dag Hammarskjold"},
{"quote":"Truth is the ultimate power. When the truth comes around, all the lies have to run and hide.", "author": "Ice Cube"},
{"quote":"The truth is that I know very few novelists who have been satisfied with the adaptation of their books for the screen.", "author": "Gabriel Garcia Marquez"},
{"quote":"Philosophy is a kind of journey, ever learning yet never arriving at the ideal perfection of truth.", "author": "Albert Pike"},
{"quote":"It is not the possession of truth, but the success which attends the seeking after it, that enriches the seeker and brings happiness to him.", "author": "Max Planck"},
{"quote":"Not truth, but faith, it is that keeps the world alive.", "author": "Edna St. Vincent Millay"},
{"quote":"Alas! they had been friends in youth; but whispering tongues can poison truth.", "author": "Samuel Taylor Coleridge"},
{"quote":"Wallow too much in sensitivity and you can't deal with life, or the truth.", "author": "Neal Boortz"},
{"quote":"In order to feel loved, be respected and stay connected, we humans have a tendency to lie. We lie about who we are, what we want, what we need, what we have done or will do. Perhaps 'lie' is too strong a word. Let me say that what we do is withhold the truth.", "author": "Iyanla Vanzant"},
{"quote":"A priest is he who lives solely in the realm of the invisible, for whom all that is visible has only the truth of an allegory.", "author": "Karl Wilhelm Friedrich Schlegel"},
{"quote":"Using the power you derive from the discovery of the truth about racism in South Africa, you will help us to remake our part of the world into a corner of the globe on which all - of which all of humanity can be proud.", "author": "Oliver Tambo"},
{"quote":"To any artist, worthy of the name, all in nature is beautiful, because his eyes, fearlessly accepting all exterior truth, read there, as in an open book, all the inner truth.", "author": "Auguste Rodin"},
{"quote":"The first holy truth in God 101 is that men and women of true faith have always had to accept the mystery of God's identity and love and ways. I hate that, but it's the truth.", "author": "Anne Lamott"},
{"quote":"To attempt seeing Truth without knowing Falsehood. It is the attempt to see the Light without knowing the Darkness. It cannot be.", "author": "Frank Herbert"},
{"quote":"A few observation and much reasoning lead to error; many observations and a little reasoning to truth.", "author": "Alexis Carrel"},
{"quote":"One can re-create what was in the mind of a mathematician a thousand years ago, recapture the truth of the intellect wherever it may have once come to light; but the image of art, that infinite variable of perception and expression in the individual, - that is not easily re-created, at least, not with certainty and in its original fulness.", "author": "George Edward Woodberry"},
{"quote":"Truth is, I think, if God just gave us our daily bread, many of us would be angry. 'That's all you're going to give me? You're just going to give me enough to sustain me for today? What about tomorrow or next year or 10, 20, 30 years from now? I want to know that I'm set up.' And yet Jesus says just pray for your daily provisions.", "author": "Francis Chan"},
{"quote":"The three-year-old who lies about taking a cookie isn't really a liar after all. He simply can't control his impulses. He then convinces himself of a new truth and, eager for your approval, reports the version that he knows will make you happy.", "author": "Cathy Rindner Tempelsman"},
{"quote":"If you spend a lot of time lying to people, you think a lot about what the truth means.", "author": "Penn Jillette"},
{"quote":"We're not going to have the America that we want until we elect leaders who are going to tell the truth - not most days, but every day.", "author": "Ann Richards"},
{"quote":"Back in the late '90s, I put together a humorous newsmagazine program called 'The Awful Truth' for Bravo. We helped one guy get an organ transplant whose insurance company had refused to pay. I thought, if we could save a guy's life in a 10-minute segment on cable, what could we do if we devoted a whole movie to a whole bunch of people?", "author": "Michael Moore"},
{"quote":"Until we have a better relationship between private performance and the public truth, as was demonstrated with Watergate, we as the public are absolutely right to remain suspicious, contemptuous even, of the secrecy and the misinformation which is the digest of our news.", "author": "John le Carre"},
{"quote":"I am not struck so much by the diversity of testimony as by the many-sidedness of truth.", "author": "Stanley Baldwin"},
{"quote":"I kind of got my big break with 'The Princess Diaries' and during the press rounds for that everyone asked me: 'Did you always want to be a princess growing up?' And the truth was, no I wanted to be Catwoman.", "author": "Anne Hathaway"},
{"quote":"Truth is the cry of all, but the game of few.", "author": "George Berkeley"},
{"quote":"I believe that in the end the truth will conquer.", "author": "John Wycliffe"},
{"quote":"I tell the truth, and I expose myself as a weak, misguided, misdirected, dysfunctional human being I used to be.", "author": "Russell Means"},
{"quote":"Semantics is about the relation of words to thoughts, but it also about the relation of words to other human concerns. Semantics is about the relation of words to reality - the way that speakers commit themselves to a shared understanding of the truth, and the way their thoughts are anchored to things and situations in the world.", "author": "Steven Pinker"},
{"quote":"In truth, the only restrictions on our capacity to astonish ourselves and each other are imposed by our own minds.", "author": "David Blaine"},
{"quote":"Such truth, as opposeth no man's profit, nor pleasure, is to all men welcome.", "author": "Thomas Hobbes"},
{"quote":"There is no power on earth more formidable than the truth.", "author": "Margaret Lee Runbeck"},
{"quote":"There is an element of truth in every idea that lasts long enough to be called corny.", "author": "Irving Berlin"},
{"quote":"Now, I know you expected me to say that, well, I just kick back in the rocking chair, fished a little bit, listened to Willie Nelson tapes and watched old baseball games on the Classic Sports network. And, tell you the truth, I have done that for maybe about five total minutes.", "author": "Dan Rather"},
{"quote":"If the reporter has killed our imagination with his truth, he threatens our life with his lies.", "author": "Karl Kraus"},
{"quote":"As for the men in power, they are so anxious to establish the myth of infallibility that they do their utmost to ignore truth.", "author": "Boris Pasternak"},
{"quote":"The design of Rhetoric is to remove those Prejudices that lie in the way of Truth, to Reduce the Passions to the Government of Reasons; to place our Subject in a Right Light, and excite our Hearers to a due consideration of it.", "author": "Mary Astell"},
{"quote":"The truth is that our way of celebrating the Christmas season does spring from myriad cultures and sources, from St. Nicholas to Coca-Cola advertising campaigns.", "author": "Richard Roeper"},
{"quote":"The truth is that Oxford is simply a very beautiful city in which it is convenient to segregate a certain number of the young of the nation while they are growing up.", "author": "Evelyn Waugh"},
{"quote":"I'm craving more soul, I'm craving more truth, I'm craving more socially - just people that are aware of what's going on in the world.", "author": "John Legend"},
{"quote":"More and more, as I get older, people come up to me and say, 'Thank you for all the laughter.' And my standard answer is, 'It was my pleasure.' But that's the truth.", "author": "Bob Newhart"},
{"quote":"I'm not saying everything out there is bad and toxic, but there are some things that are not scriptural. For example, some people don't understand that the law was given by Moses, but grace and truth came by Jesus Christ.", "author": "Joseph Prince"},
{"quote":"The reason for the sadness of this modern age and the men who live in it is that it looks for the truth in everything and finds it.", "author": "Edmond de Goncourt"},
{"quote":"The truth is that many powerful guys have fooled around while working for the people. Dwight Eisenhower, John F. Kennedy, and Warren Harding to name just a few. Grover Cleveland even fathered a child outside of marriage. We all know these things happen. But we don't want them to happen - at least most of us don't. I can't speak for San Francisco.", "author": "Bill O'Reilly"},
{"quote":"Trust is a core currency of any relationship. Sometimes our need to control and micromanage everything erodes our confidence in ourselves and others. The truth: People are much more capable than we think. A hearty dose of trust is often what's needed to unlock the magic. Go ahead, have faith.", "author": "Kris Carr"},
{"quote":"What I claim is to live to the full the contradiction of my time, which may well make sarcasm the condition of truth.", "author": "Roland Barthes"},
{"quote":"The truth was you can't continue to spend the kind of money our spending on all these entitlement programs. I think we need more people in public life who are willing to say, no, we can't afford certain things. No, we can't do certain things.", "author": "Chris Christie"},
{"quote":"Heaven and God are not high above us, far away; they are deep within us. Heaven is not a distant country where there are trees and houses and other objects; it is a plane of consciousness within us. Seekers of the eternal Truth will realise their eternal Heaven within their aspiring hearts.", "author": "Sri Chinmoy"},
{"quote":"Love and compassion don't at all have to make us weak, or lead us to losing discernment and vision. We just have to learn how to find them. And see, in truth, what they bring us.", "author": "Sharon Salzberg"},
{"quote":"Someone needs to tell the truth, but it shouldn't be my job.", "author": "Thom Yorke"},
{"quote":"The eye by long use comes to see even in the darkest cavern: and there is no subject so obscure but we may discern some glimpse of truth by long poring on it.", "author": "George Berkeley"},
{"quote":"The immediate future is going to be tragic for all of us unless we find a way of making the vast educational resources of this country serve the true purpose of education, truth and justice.", "author": "Anne Sullivan"},
{"quote":"A sincere seeker knows what his goal is: the highest Truth. He will not delay his journey. In spiritual life, we aspire for the highest Truth, for God, nothing else.", "author": "Sri Chinmoy"},
{"quote":"You know that everyone thinks that in order to do South Park we must be wild, crazy, rock and roll stars. But the truth is we're just wholesome middle-American guys. We enjoy soda pop, baseball and beating up old people just as much as anybody.", "author": "Trey Parker"},
{"quote":"Despite the fact that in America we incarcerate more juveniles for life terms than in any other country in the world, the truth is that the vast majority of youth offenders will one day be released. The question is simple and stark. Do we want to help them change or do we want to help them become even more violent and dangerous?", "author": "Ayelet Waldman"},
{"quote":"Hope is nature's veil for hiding truth's nakedness.", "author": "Alfred Nobel"},
{"quote":"I'm very good at breaking up with people. Very good. It requires a lot of skill, but what you do is you tell them the truth of why you are breaking up with them, and after that, you somehow compensate with other things. If you have loved someone, I think that somehow they should always be a part of your life. I really do.", "author": "Diane von Furstenberg"},
{"quote":"The original fairy tale was about the youngest sister going into a room in the castle and finding all the bodies of the wives that came before her - she is confronted with truth, thinking about how often we think we know people and we really don't.", "author": "Alice Hoffman"},
{"quote":"But the truth of the matter is, we're an open society, we want to remain an open society, and there will continue to be vulnerability. That's why we have to meet the threats when they are not yet taking place on our territory and on our soil.", "author": "Condoleezza Rice"},
{"quote":"In Mexico, when we want to speak deep secrets, we drink pulgue together. It is a drink made from the cactus plant, and when you take the bottle from your mouth, it leaves a string behind, between the mouth and the bottle, like a spider's web. It shows that the truth sticks inside.", "author": "Alejandro Jodorowsky"},
{"quote":"In all science, error precedes the truth, and it is better it should go first than last.", "author": "Hugh Walpole"},
{"quote":"It is proper that noble spirits, equipped with truth and enlightened with the Divine intelligence, should arm themselves against dense ignorance by climbing up to the high rock and tower of contemplation.", "author": "Giordano Bruno"},
{"quote":"Humor is the truth; wit is an exaggeration of the truth.", "author": "Stan Laurel"},
{"quote":"To begin with myself, then, the utterances of men concerning me will differ widely, since in passing judgment almost every one is influenced not so much by truth as by preference, and good and evil report alike know no bounds.", "author": "Petrarch"},
{"quote":"The real truth is that the Obama administration is professional at bullying, as we have witnessed with ACORN at work during the presidential campaign. It seems to me they are sending down their bullies to create fist fights among average American citizens who don't want a government-run health care plan forced upon them.", "author": "Jon Voight"},
{"quote":"It is difficult to separate, at times, the myth from the truth.", "author": "Bob Kane"},
{"quote":"The truth is that politicians are basically tied to trying to get reelected, so they can't really make landmark changes.", "author": "Jim Brown"},
{"quote":"I don't for one second think about the possibility of censorship when I am writing a new book. I know I am a person who cares about kids and who cares about truth and I am guided by my own instincts, and trust them.", "author": "Lois Lowry"},
{"quote":"To tell the truth I cannot call my childhood bad. In your childhood you can't compare things: one eats carrots, one eats candy, both taste good. As a child you cannot tell the difference.", "author": "Roman Abramovich"},
{"quote":"There are dozens of references to God in the Scriptures for every one to the figure of Satan. This reflects a sometimes forgotten theological truth that the devil is by no means God's counterpart. He is a creature, not the Creator.", "author": "John Ortberg"},
{"quote":"When we discover that the truth is already in us, we are all at once our original selves.", "author": "Dogen"},
{"quote":"A single moment spent in a business meeting or at a pub is more than enough to reveal the basic human truth that we are all faking it most of the time. We congratulate a rival on a triumph when actually we are choking on spite. We are cordial and attentive to crashing bores.", "author": "Jeff Lindsay"},
{"quote":"Despite all the lunacy of the last century, all the absurdity of war and genocide, we believe that humans being are rational and are made to seek the truth.", "author": "Timothy Radcliffe"},
{"quote":"As a nation - and as a world - we need more truth.", "author": "John Legend"},
{"quote":"Truly, love is delightful and pleasant food, supplying, as it does, rest to the weary, strength to the weak, and joy to the sorrowful. It in fact renders the yoke of truth easy and its burden light.", "author": "Saint Bernard"},
{"quote":"The modern composer builds upon the foundation of truth.", "author": "Claudio Monteverdi"},
{"quote":"Humans love truth and justice, and rejoice in ceremonies that honor those qualities. For that sentiment we should indeed thank God.", "author": "Alfred Day Hershey"},
{"quote":"For me as an actor, daring is to tell the truth - to be yourself, no matter how the world interacts with that.", "author": "Taylor Schilling"},
{"quote":"Power and position often make a man trifle with the truth.", "author": "George A. Smith"},
{"quote":"Some Internet operators are concerned that video services such as Netflix and YouTube consume lots of the bandwidth on the network. While there is some truth to this, my guess is that the operators wished they could provide the same kind of services with the same success as Netflix and YouTube.", "author": "Niklas Zennstrom"},
{"quote":"I can't help believing that these things that come from the subconscious mind have a sort of truth to them. It may not be a scientific truth, but it's psychological truth.", "author": "Brian Aldiss"},
{"quote":"For me, I don't feel it is a success in the career to be the pretty woman; career success comes from being characters who tell us something about the truth.", "author": "Emmanuelle Beart"},
{"quote":"Certainly all historical experience confirms the truth - that man would not have attained the possible unless time and again he had reached out for the impossible.", "author": "Max Weber"},
{"quote":"Willing or preferring is the same with respect to good and evil, that judging is with respect to truth or falsehood.", "author": "Anthony Collins"},
{"quote":"That taxes may be the ostensible cause is true, but that they are the true cause is as far remote from truth as light from darkness.", "author": "Henry Knox"},
{"quote":"If modernist naturalism were true, there would be no objective truth outside of science. In that case right and wrong would be a matter of cultural preference, or political power, and the power already available to modernists ideologies would be overwhelming.", "author": "Phillip E. Johnson"},
{"quote":"The truth is that contraception saves lives, prevents unplanned pregnancies, improves outcomes for children and reduces the number of abortions.", "author": "Ann McLane Kuster"},
{"quote":"We also learn that this country and the Western world have no monopoly of goodness and truth and scholarship, we begin to appreciate the ingredients that are indispensable to making a better world. In a life of learning that is, perhaps, the greatest lesson of all.", "author": "John Hope Franklin"},
{"quote":"I regard myself as a beautiful musical instrument, and my role is to contribute that instrument to scripts worthy of it. And hopefully the music we play will be about decent human beings fighting against disease, fighting against corruption, fighting for the truth... and fighting for a day when all our jails are empty, and all our schools are full.", "author": "Ed Asner"},
{"quote":"It is of no help to us that there is an absolute truth of the matter of things because unfortunately, none of us are in a position to say definitively what that is - although we all think that we are.", "author": "Stanley Fish"},
{"quote":"We are turning against boys and forgetting a simple truth: that the energy, competitiveness, and corporal daring of normal, decent males is responsible for much of what is right in the world.", "author": "Christina Hoff Sommers"},
{"quote":"Now the true soldiers of Christ must always be prepared to do battle for the truth, and must never, so far as lies with them, allow false convictions to creep in.", "author": "Origen"},
{"quote":"In the different voice of women lies the truth of an ethic of care, the tie between relationship and responsibility, and the origins of aggression in the failure of connection.", "author": "Carol Gilligan"},
{"quote":"Will it please you to answer me this and to give me a rule for then I will willingly submit to any truth.", "author": "Anne Hutchinson"},
{"quote":"But, the truth is and we can argue about whether this is right or not as long as we want to, but the fact is that women really do spend more time with their families. Until I can find a man who can tell me the dates of all of his nieces and nephews birthdays and get presents out to them regularly, I'm going to stay by that statement.", "author": "Cokie Roberts"},
{"quote":"What do you mean by faith? Is faith enough for Man? Should he be satisfied with faith alone? Is there no way of finding out the truth? Is the attitude of faith, of believing in something for which there can be no more than philosophic proof, the true mark of a Christian?", "author": "Clifford D. Simak"},
{"quote":"The truth is women use contraception not only as a way to prevent unintended pregnancies, but also to improve their health and the health of their families. Increased access to contraception is directly linked to declines in maternal and infant mortality.", "author": "Felicity Huffman"},
{"quote":"I learned one thing in Watergate: I was well-intentioned but rationalized illegal behavior,' he said. 'You cannot live your life other than walking in the truth. Your means are as important as your ends.", "author": "Charles Colson"},
{"quote":"It kind of irritates me that I'm seen as this pretty face. People also say I'm too thin. The truth is pretty people aren't as accepted as other people. It comes with all these stigmas.", "author": "Mischa Barton"},
{"quote":"Men occasionally stumble over the truth, but most of them pick themselves up and hurry off as if nothing had happened.", "author": "Winston Churchill"},
{"quote":"Truth is mighty and will prevail. There is nothing wrong with this, except that it ain't so.", "author": "Mark Twain"},
{"quote":"Truth stands, even if there be no public support. It is self-sustained.", "author": "Mahatma Gandhi"},
{"quote":"I've still not written as well as I want to. I want to write so that the reader in Des Moines, Iowa, in Kowloon, China, in Cape Town, South Africa, can say, 'You know, that's the truth. I wasn't there, and I wasn't a six-foot black girl, but that's the truth.'", "author": "Maya Angelou"},
{"quote":"People say children are charming because they tell the truth. That's a lie. I've got five of them. They only tell the truth if they're in pain.", "author": "Bill Cosby"},
{"quote":"The absolute truth is that there is no power in celebrity.", "author": "Bill Cosby"},
{"quote":"Ignorance is preferable to error, and he is less remote from the truth who believes nothing than he who believes what is wrong.", "author": "Thomas Jefferson"},
{"quote":"The least initial deviation from the truth is multiplied later a thousandfold.", "author": "Aristotle"},
{"quote":"There is not a truth existing which I fear... or would wish unknown to the whole world.", "author": "Thomas Jefferson"},
{"quote":"Every mind must make its choice between truth and repose. It cannot have both.", "author": "Ralph Waldo Emerson"},
{"quote":"Fiction reveals truth that reality obscures.", "author": "Ralph Waldo Emerson"},
{"quote":"Truth is handsomer than the affectation of love. Your goodness must have some edge to it, else it is none.", "author": "Ralph Waldo Emerson"},
{"quote":"Truth is the property of no individual but is the treasure of all men.", "author": "Ralph Waldo Emerson"},
{"quote":"Convictions are more dangerous foes of truth than lies.", "author": "Friedrich Nietzsche"},
{"quote":"Truth is always in harmony with herself, and is not concerned chiefly to reveal the justice that may consist with wrong-doing.", "author": "Henry David Thoreau"},
{"quote":"No face which we can give to a matter will stead us so well at last as the truth. This alone wears well.", "author": "Henry David Thoreau"},
{"quote":"Only on paper has humanity yet achieved glory, beauty, truth, knowledge, virtue, and abiding love.", "author": "George Bernard Shaw"},
{"quote":"Truth, like light, blinds. Falsehood, on the contrary, is a beautiful twilight that enhances every object.", "author": "Albert Camus"},
{"quote":"Poetry is nearer to vital truth than history.", "author": "Plato"},
{"quote":"The reason that fiction is more interesting than any other form of literature, to those who really like to study people, is that in fiction the author can really tell the truth without humiliating himself.", "author": "Jim Rohn"},
{"quote":"There are websites that any government wants to block. The truth about the Internet is that it's extremely hard to block anything - extremely hard. You'll never get perfect blocking.", "author": "Bill Gates"},
{"quote":"A remark generally hurts in proportion to its truth.", "author": "Will Rogers"},
{"quote":"The thing you fear most has no power. Your fear of it is what has the power. Facing the truth really will set you free.", "author": "Oprah Winfrey"},
{"quote":"It's much easier for me to make major life, multi-million dollar decisions, than it is to decide on a carpet for my front porch. That's the truth.", "author": "Oprah Winfrey"},
{"quote":"Beyond a doubt truth bears the same relation to falsehood as light to darkness.", "author": "Leonardo da Vinci"},
{"quote":"You shall know the truth, and the truth shall make you mad.", "author": "Aldous Huxley"},
{"quote":"The truth of things is the chief nutriment of superior intellects.", "author": "Leonardo da Vinci"},
{"quote":"Time discovers truth.", "author": "Lucius Annaeus Seneca"},
{"quote":"An unexciting truth may be eclipsed by a thrilling lie.", "author": "Aldous Huxley"},
{"quote":"Truth has no special time of its own. Its hour is now - always.", "author": "Albert Schweitzer"},
{"quote":"You wanna get the truth out of me, get me hammered.", "author": "Ron White"},
{"quote":"Personality is only ripe when a man has made the truth his own.", "author": "Soren Kierkegaard"},
{"quote":"Bigotry tries to keep truth safe in its hand with a grip that kills it.", "author": "Rabindranath Tagore"},
{"quote":"Proverbs are always platitudes until you have personally experienced the truth of them.", "author": "Aldous Huxley"},
{"quote":"For a creative writer possession of the 'truth' is less important than emotional sincerity.", "author": "George Orwell"},
{"quote":"If there were only one truth, you couldn't paint a hundred canvases on the same theme.", "author": "Pablo Picasso"},
{"quote":"Truth is what works.", "author": "William James"},
{"quote":"Nine times out of ten, in the arts as in life, there is actually no truth to be discovered; there is only error to be exposed.", "author": "H. L. Mencken"},
{"quote":"We have to live today by what truth we can get today and be ready tomorrow to call it falsehood.", "author": "William James"},
{"quote":"It is a melancholy truth that even great men have their poor relations.", "author": "Charles Dickens"},
{"quote":"No one can look back on his schooldays and say with truth that they were altogether unhappy.", "author": "George Orwell"},
{"quote":"In the last few years, the very idea of telling the truth, the whole truth, and nothing but the truth is dredged up only as a final resort when the alternative options of deception, threat and bribery have all been exhausted.", "author": "Michael Musto"},
{"quote":"The truth needs so little rehearsal.", "author": "Barbara Kingsolver"},
{"quote":"Gossip needn't be false to be evil - there's a lot of truth that shouldn't be passed around.", "author": "Frank A. Clark"},
{"quote":"A lie which is half a truth is ever the blackest of lies.", "author": "Alfred Lord Tennyson"},
{"quote":"Facts are many, but the truth is one.", "author": "Rabindranath Tagore"},
{"quote":"If you shut up truth, and bury it underground, it will but grow.", "author": "Emile Zola"},
{"quote":"The truth. It is a beautiful and terrible thing, and must therefore be treated with great caution.", "author": "J. K. Rowling"},
{"quote":"I maintain that Truth is a pathless land, and you cannot approach it by any path whatsoever, by any religion, by any sect.", "author": "Jiddu Krishnamurti"},
{"quote":"An error does not become truth by reason of multiplied propagation, nor does truth become error because nobody sees it.", "author": "Mahatma Gandhi"},
{"quote":"If you are out to describe the truth, leave elegance to the tailor.", "author": "Albert Einstein"},
{"quote":"The first reaction to truth is hatred.", "author": "Tertullian"},
{"quote":"Doubt is the incentive to truth and inquiry leads the way.", "author": "Hosea Ballou"},
{"quote":"I tore myself away from the safe comfort of certainties through my love for truth - and truth rewarded me.", "author": "Simone de Beauvoir"},
{"quote":"Peace if possible, truth at all costs.", "author": "Martin Luther"},
{"quote":"For my part, whatever anguish of spirit it may cost, I am willing to know the whole truth; to know the worst and provide for it.", "author": "Patrick Henry"},
{"quote":"Scientific truth is marvelous, but moral truth is divine and whoever breathes its air and walks by its light has found the lost paradise.", "author": "Horace Mann"},
{"quote":"The words of truth are always paradoxical.", "author": "Lao Tzu"},
{"quote":"I preach there are all kinds of truth, your truth and somebody else's. But behind all of them there is only one truth and that is that there's no truth.", "author": "Flannery O'Connor"},
{"quote":"Cynicism is an unpleasant way of saying the truth.", "author": "Lillian Hellman"},
{"quote":"I always felt that a scientist owes the world only one thing, and that is the truth as he sees it.", "author": "Hans Eysenck"},
{"quote":"Sincerity is moral truth.", "author": "George Henry Lewes"},
{"quote":"It is the nature of truth in general, as of some ores in particular, to be richest when most superficial.", "author": "Edgar Allan Poe"},
{"quote":"The earth is supported by the power of truth; it is the power of truth that makes the sun shine and the winds blow; indeed all things rest upon truth.", "author": "Chanakya"},
{"quote":"It becomes more necessary to see the truth as it is if you realize that the only vehicle for change are these people who have lost their personality.", "author": "Steven Biko"},
{"quote":"Truth is by nature self-evident. As soon as you remove the cobwebs of ignorance that surround it, it shines clear.", "author": "Mahatma Gandhi"},
{"quote":"To rise from error to truth is rare and beautiful.", "author": "Victor Hugo"},
{"quote":"But such is the irresistable nature of truth, that all it asks, and all it wants is the liberty of appearing.", "author": "Thomas Paine"},
{"quote":"I have been thinking that I would make a proposition to my Republican friends... that if they will stop telling lies about the Democrats, we will stop telling the truth about them.", "author": "Adlai E. Stevenson"},
{"quote":"A good novel tells us the truth about its hero; but a bad novel tells us the truth about its author.", "author": "Gilbert K. Chesterton"},
{"quote":"There's no truth anymore.", "author": "Johnny Depp"},
{"quote":"Truth lives, in fact, for the most part on a credit system. Our thoughts and beliefs pass, so long as nothing challenges them, just as bank-notes pass so long as nobody refuses them.", "author": "William James"},
{"quote":"There is no truth. There is only perception.", "author": "Gustave Flaubert"},
{"quote":"We know the truth, not only by the reason, but also by the heart.", "author": "Blaise Pascal"},
{"quote":"I have the terrible feeling that, because I am wearing a white beard and am sitting in the back of the theatre, you expect me to tell you the truth about something. These are the cheap seats, not Mount Sinai.", "author": "Orson Welles"},
{"quote":"In matters of truth the fact that you don't want to publish something is, nine times out of ten, a proof that you ought to publish it.", "author": "Gilbert K. Chesterton"},
{"quote":"Ah, well, the truth is always one thing, but in a way it's the other thing, the gossip, that counts. It shows where people's hearts lie.", "author": "Paul Scott"},
{"quote":"When you stretch the truth, watch out for the snapback.", "author": "Bill Copeland"},
{"quote":"A fact never went into partnership with a miracle. Truth scorns the assistance of wonders. A fact will fit every other fact in the universe, and that is how you can tell whether it is or is not a fact. A lie will not fit anything except another lie.", "author": "Robert Green Ingersoll"},
{"quote":"In everything truth surpasses the imitation and copy.", "author": "Marcus Tullius Cicero"},
{"quote":"Nothing gives rest but the sincere search for truth.", "author": "Blaise Pascal"},
{"quote":"One must know oneself. If this does not serve to discover truth, it at least serves as a rule of life and there is nothing better.", "author": "Blaise Pascal"},
{"quote":"Friendless. Having no favors to bestow. Destitute of fortune. Addicted to utterance of truth and common sense.", "author": "Ambrose Bierce"},
{"quote":"One truth stands firm. All that happens in world history rests on something spiritual. If the spiritual is strong, it creates world history. If it is weak, it suffers world history.", "author": "Albert Schweitzer"},
{"quote":"The central conservative truth is that it is culture, not politics, that determines the success of a society. The central liberal truth is that politics can change a culture and save it from itself.", "author": "Daniel Patrick Moynihan"},
{"quote":"For, if a good speaker, never so eloquent, does not see into the fact, and is not speaking the truth of that - is there a more horrid kind of object in creation?", "author": "Thomas Carlyle"},
{"quote":"So near is falsehood to truth that a wise man would do well not to trust himself on the narrow edge.", "author": "Marcus Tullius Cicero"},
{"quote":"'How much longer will I live?'... Only one thing seems clear to me. Every day should be well-lived. What a simple truth! Still, it is worthy of my attention.", "author": "Henri Nouwen"},
{"quote":"Every legend, moreover, contains its residuum of truth, and the root function of language is to control the universe by describing it.", "author": "James A. Baldwin"},
{"quote":"Legends die hard. They survive as truth rarely does.", "author": "Helen Hayes"},
{"quote":"Do the things you know, and you shall learn the truth you need to know.", "author": "Louisa May Alcott"},
{"quote":"Tell the children the truth.", "author": "Bob Marley"},
{"quote":"Truth is certainly a branch of morality and a very important one to society.", "author": "Thomas Jefferson"},
{"quote":"The absurd is the essential concept and the first truth.", "author": "Albert Camus"},
{"quote":"Gossip is called gossip because it's not always the truth.", "author": "Justin Timberlake"},
{"quote":"Truth is the most valuable thing we have. Let us economize it.", "author": "Mark Twain"},
{"quote":"We are either in the process of resisting God's truth or in the process of being shaped and molded by his truth.", "author": "Charles Stanley"},
{"quote":"Sometimes the truth hurts. And sometimes it feels real good.", "author": "Henry Rollins"},
{"quote":"Truth is tough. It will not break, like a bubble, at a touch; nay, you may kick it about all day like a football, and it will be round and full at evening.", "author": "Oliver Wendell Holmes, Sr."},
{"quote":"Truth is not only violated by falsehood; it may be equally outraged by silence.", "author": "Henri Frederic Amiel"},
{"quote":"Human love has little regard for the truth. It makes the truth relative, since nothing, not even the truth, must come between it and the beloved person.", "author": "Dietrich Bonhoeffer"},
{"quote":"There is another old poet whose name I do not now remember who said, 'Truth is the daughter of Time.'", "author": "Abraham Lincoln"},
{"quote":"The truth of the matter is that you always know the right thing to do. The hard part is doing it.", "author": "Robert H. Schuller"},
{"quote":"There are trivial truths and the great truths. The opposite of a trivial truth is plainly false. The opposite of a great truth is also true.", "author": "Niels Bohr"},
{"quote":"All credibility, all good conscience, all evidence of truth come only from the senses.", "author": "Friedrich Nietzsche"},
{"quote":"Plato is dear to me, but dearer still is truth.", "author": "Aristotle"},
{"quote":"My mother taught me that when you stand in the truth and someone tells a lie about you, don't fight it.", "author": "Whitney Houston"},
{"quote":"Truth is so rare that it is delightful to tell it.", "author": "Emily Dickinson"},
{"quote":"A harmful truth is better than a useful lie.", "author": "Thomas Mann"},
{"quote":"Infinite love is the only truth. Everything else is illusion.", "author": "David Icke"},
{"quote":"Truth is always served by great minds, even if they fight it.", "author": "Jean Rostand"},
{"quote":"Truth gets well if she is run over by a locomotive, while error dies of lockjaw if she scratches her finger.", "author": "William C. Bryant"},
{"quote":"The sad truth is that excellence makes people nervous.", "author": "Shana Alexander"},
{"quote":"Truth is beautiful, without doubt; but so are lies.", "author": "Ralph Waldo Emerson"},
{"quote":"A taste for truth at any cost is a passion which spares nothing.", "author": "Albert Camus"},
{"quote":"Live truth instead of professing it.", "author": "Elbert Hubbard"},
{"quote":"Never apologize for showing feeling. When you do so, you apologize for the truth.", "author": "Benjamin Disraeli"},
{"quote":"All the truth in the world adds up to one big lie.", "author": "Bob Dylan"},
{"quote":"We all know that Art is not truth. Art is a lie that makes us realize the truth, at least the truth that is given to us to understand.", "author": "Pablo Picasso"},
{"quote":"The truth is more important than the facts.", "author": "Frank Lloyd Wright"},
{"quote":"I say that justice is truth in action.", "author": "Benjamin Disraeli"},
{"quote":"Silence is the mother of truth.", "author": "Benjamin Disraeli"},
{"quote":"Truth is a tendency.", "author": "R. Buckminster Fuller"},
{"quote":"The pursuit of truth will set you free; even if you never catch up with it.", "author": "Clarence Darrow"},
{"quote":"If any man seeks for greatness, let him forget greatness and ask for truth, and he will find both.", "author": "Horace Mann"},
{"quote":"My longing for truth was a single prayer.", "author": "Edith Stein"},
{"quote":"Nobody speaks the truth when there is something they must have.", "author": "Elizabeth Bowen"},
{"quote":"Truth disappears with the telling of it.", "author": "Lawrence Durrell"},
{"quote":"Truth is stranger than fiction; fiction has to make sense.", "author": "Leo Rosten"},
{"quote":"What is truth? Truth doesn't really exist. Who is going to judge whether my experience of an incident is more valid than yours? No one can be trusted to be the judge of that.", "author": "Tracey Emin"},
{"quote":"The intuition of free will gives us the truth.", "author": "Corliss Lamont"},
{"quote":"Sure I think it is healthy to speak the truth, and be who you are, and be proud of that.", "author": "Nathan Lane"},
{"quote":"Truth sits upon the lips of dying men.", "author": "Matthew Arnold"},
{"quote":"The truth is you don't know what is going to happen tomorrow. Life is a crazy ride, and nothing is guaranteed.", "author": "Eminem"},
{"quote":"Truth is everybody is going to hurt you: you just gotta find the ones worth suffering for.", "author": "Bob Marley"},
{"quote":"Truth is, I'll never know all there is to know about you just as you will never know all there is to know about me. Humans are by nature too complicated to be understood fully. So, we can choose either to approach our fellow human beings with suspicion or to approach them with an open mind, a dash of optimism and a great deal of candour.", "author": "Tom Hanks"},
{"quote":"Our heavenly Father understands our disappointment, suffering, pain, fear, and doubt. He is always there to encourage our hearts and help us understand that He's sufficient for all of our needs. When I accepted this as an absolute truth in my life, I found that my worrying stopped.", "author": "Charles Stanley"},
{"quote":"I refuse to accept the view that mankind is so tragically bound to the starless midnight of racism and war that the bright daybreak of peace and brotherhood can never become a reality... I believe that unarmed truth and unconditional love will have the final word.", "author": "Martin Luther King, Jr."},
{"quote":"I know where I'm going and I know the truth, and I don't have to be what you want me to be. I'm free to be what I want.", "author": "Muhammad Ali"},
{"quote":"I love you, and because I love you, I would sooner have you hate me for telling you the truth than adore me for telling you lies.", "author": "Pietro Aretino"},
{"quote":"Whoever is careless with the truth in small matters cannot be trusted with important matters.", "author": "Albert Einstein"},
{"quote":"We learned about honesty and integrity - that the truth matters... that you don't take shortcuts or play by your own set of rules... and success doesn't count unless you earn it fair and square.", "author": "Michelle Obama"},
{"quote":"Doubt thou the stars are fire, Doubt that the sun doth move. Doubt truth to be a liar, But never doubt I love.", "author": "William Shakespeare"},
{"quote":"The goal of education is the advancement of knowledge and the dissemination of truth.", "author": "John F. Kennedy"},
{"quote":"When you are joyous, look deep into your heart and you shall find it is only that which has given you sorrow that is giving you joy. When you are sorrowful look again in your heart, and you shall see that in truth you are weeping for that which has been your delight.", "author": "Khalil Gibran"},
{"quote":"I do not know what I may appear to the world, but to myself I seem to have been only like a boy playing on the seashore, and diverting myself in now and then finding a smoother pebble or a prettier shell than ordinary, whilst the great ocean of truth lay all undiscovered before me.", "author": "Isaac Newton"},
{"quote":"Enlightened leadership is spiritual if we understand spirituality not as some kind of religious dogma or ideology but as the domain of awareness where we experience values like truth, goodness, beauty, love and compassion, and also intuition, creativity, insight and focused attention.", "author": "Deepak Chopra"},
{"quote":"Be Impeccable With Your Word. Speak with integrity. Say only what you mean. Avoid using the word to speak against yourself or to gossip about others. Use the power of your word in the direction of truth and love.", "author": "Miguel Angel Ruiz"},
{"quote":"It is impossible to struggle for civil rights, equal rights for blacks, without including whites. Because equal rights, fair play, justice, are all like the air: we all have it, or none of us has it. That is the truth of it.", "author": "Maya Angelou"},
{"quote":"All things are subject to interpretation whichever interpretation prevails at a given time is a function of power and not truth.", "author": "Friedrich Nietzsche"},
{"quote":"For every good reason there is to lie, there is a better reason to tell the truth.", "author": "Bo Bennett"},
{"quote":"Let us dream of tomorrow where we can truly love from the soul, and know love as the ultimate truth at the heart of all creation.", "author": "Michael Jackson"},
{"quote":"Have the courage to say no. Have the courage to face the truth. Do the right thing because it is right. These are the magic keys to living your life with integrity.", "author": "W. Clement Stone"},
{"quote":"Let the future tell the truth, and evaluate each one according to his work and accomplishments. The present is theirs; the future, for which I have really worked, is mine.", "author": "Nikola Tesla"},
{"quote":"Beauty is truth's smile when she beholds her own face in a perfect mirror.", "author": "Rabindranath Tagore"},
{"quote":"There is some self-interest behind every friendship. There is no friendship without self-interests. This is a bitter truth.", "author": "Chanakya"},
{"quote":"The dream begins with a teacher who believes in you, who tugs and pushes and leads you to the next plateau, sometimes poking you with a sharp stick called 'truth'.", "author": "Dan Rather"},
{"quote":"The books that help you most are those which make you think that most. The hardest way of learning is that of easy reading; but a great book that comes from a great thinker is a ship of thought, deep freighted with truth and beauty.", "author": "Pablo Neruda"},
{"quote":"The Bible is one of the greatest blessings bestowed by God on the children of men. It has God for its author; salvation for its end, and truth without any mixture for its matter. It is all pure.", "author": "John Locke"},
{"quote":"Honesty is more than not lying. It is truth telling, truth speaking, truth living, and truth loving.", "author": "James E. Faust"},
{"quote":"Women must tell men always that they are the strong ones. They are the big, the strong, the wonderful. In truth, women are the strong ones. It is just my opinion, I am not a professor.", "author": "Coco Chanel"},
{"quote":"It's in literature that true life can be found. It's under the mask of fiction that you can tell the truth.", "author": "Gao Xingjian"},
{"quote":"I learned a long time ago that some people would rather die than forgive. It's a strange truth, but forgiveness is a painful and difficult process. It's not something that happens overnight. It's an evolution of the heart.", "author": "Sue Monk Kidd"},
{"quote":"Of life's two chief prizes, beauty and truth, I found the first in a loving heart and the second in a laborer's hand.", "author": "Khalil Gibran"},
{"quote":"Peace demands the most heroic labor and the most difficult sacrifice. It demands greater heroism than war. It demands greater fidelity to the truth and a much more perfect purity of conscience.", "author": "Thomas Merton"},
{"quote":"There is no greatness where there is no simplicity, goodness and truth.", "author": "Leo Tolstoy"},
{"quote":"A lie can travel half way around the world while the truth is putting on its shoes.", "author": "Charles Spurgeon"},
{"quote":"Light is meaningful only in relation to darkness, and truth presupposes error. It is these mingled opposites which people our life, which make it pungent, intoxicating. We only exist in terms of this conflict, in the zone where black and white clash.", "author": "Louis Aragon"},
{"quote":"A liar will not be believed, even when he speaks the truth.", "author": "Aesop"},
{"quote":"It's a complete lie, why do people buy these papers? It's not the truth I'm here to say. You know, don't judge a person, do not pass judgement, unless you have talked to them one on one. I don't care what the story is, do not judge them because it is a lie.", "author": "Michael Jackson"},
{"quote":"Love is the crowning grace of humanity, the holiest right of the soul, the golden link which binds us to duty and truth, the redeeming principle that chiefly reconciles the heart to life, and is prophetic of eternal good.", "author": "Petrarch"},
{"quote":"Despite my firm convictions, I have always been a man who tries to face facts, and to accept the reality of life as new experience and new knowledge unfolds. I have always kept an open mind, a flexibility that must go hand in hand with every form of the intelligent search for truth.", "author": "Malcolm X"},
{"quote":"Belief is a wise wager. Granted that faith cannot be proved, what harm will come to you if you gamble on its truth and it proves false? If you gain, you gain all; if you lose, you lose nothing. Wager, then, without hesitation, that He exists.", "author": "Blaise Pascal"},
{"quote":"Genocide is not just a murderous madness; it is, more deeply, a politics that promises a utopia beyond politics - one people, one land, one truth, the end of difference. Since genocide is a form of political utopia, it remains an enduring temptation in any multiethnic and multicultural society in crisis.", "author": "Michael Ignatieff"},
{"quote":"Free expression is the base of human rights, the root of human nature and the mother of truth. To kill free speech is to insult human rights, to stifle human nature and to suppress truth.", "author": "Liu Xiaobo"},
{"quote":"Find out who you are and be that person. That's what your soul was put on this Earth to be. Find that truth, live that truth and everything else will come.", "author": "Ellen DeGeneres"},
{"quote":"If you want to be thought a liar, always tell the truth.", "author": "Logan Pearsall Smith"},
{"quote":"A lie told often enough becomes the truth.", "author": "Vladimir Lenin"},
{"quote":"I tell you the truth, it is hard for a rich man to enter the kingdom of heaven. Again I tell you, it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of heaven.", "author": "Jesus Christ"},
{"quote":"The trouble with lying and deceiving is that their efficiency depends entirely upon a clear notion of the truth that the liar and deceiver wishes to hide.", "author": "Hannah Arendt"},
{"quote":"In a controversy the instant we feel anger we have already ceased striving for the truth, and have begun striving for ourselves.", "author": "Buddha"},
{"quote":"Truth, according to the Christian faith, is God's love for us in Jesus Christ. Therefore, truth is a relationship.", "author": "Pope Francis"},
{"quote":"The truth is: Belonging starts with self-acceptance. Your level of belonging, in fact, can never be greater than your level of self-acceptance, because believing that you're enough is what gives you the courage to be authentic, vulnerable and imperfect.", "author": "Brene Brown"},
{"quote":"The best way to obtain truth and wisdom is not to ask from books, but to go to God in prayer, and obtain divine teaching.", "author": "Joseph Smith, Jr."},
{"quote":"The moment we begin to fear the opinions of others and hesitate to tell the truth that is in us, and from motives of policy are silent when we should speak, the divine floods of light and life no longer flow into our souls.", "author": "Elizabeth Cady Stanton"},
{"quote":"Even in literature and art, no man who bothers about originality will ever be original: whereas if you simply try to tell the truth (without caring twopence how often it has been told before) you will, nine times out of ten, become original without ever having noticed it.", "author": "C. S. Lewis"},
{"quote":"To love our neighbor as ourselves is such a truth for regulating human society, that by that alone one might determine all the cases in social morality.", "author": "John Locke"},
{"quote":"Friendship at first sight, like love at first sight, is said to be the only truth.", "author": "Herman Melville"},
{"quote":"When you are sorrowful look again in your heart, and you shall see that in truth you are weeping for that which has been your delight.", "author": "Khalil Gibran"},
{"quote":"Why, when we know that there's no such thing as perfect, do most of us spend an incredible amount of time and energy trying to be everything to everyone? Is it that we really admire perfection? No - the truth is that we are actually drawn to people who are real and down-to-earth. We love authenticity and we know that life is messy and imperfect.", "author": "Brene Brown"},
{"quote":"Let me get you to understand I don't bully anybody. I stand up for what I believe in and I'm very honest and I always tell the truth. I'm not a liar, I'm not manipulative and I don't stab you in your back because I will stab you in your chest.", "author": "NeNe Leakes"},
{"quote":"It is not because the truth is too difficult to see that we make mistakes... we make mistakes because the easiest and most comfortable course for us is to seek insight where it accords with our emotions - especially selfish ones.", "author": "Aleksandr Solzhenitsyn"},
{"quote":"Yesterday we obeyed kings and bent our necks before emperors. But today we kneel only to truth, follow only beauty, and obey only love.", "author": "Khalil Gibran"},
{"quote":"The discovery of truth is prevented more effectively, not by the false appearance things present and which mislead into error, not directly by weakness of the reasoning powers, but by preconceived opinion, by prejudice.", "author": "Arthur Schopenhauer"},
{"quote":"I believe there's an inner power that makes winners or losers. And the winners are the ones who really listen to the truth of their hearts.", "author": "Sylvester Stallone"},
{"quote":"I will be as harsh as truth, and uncompromising as justice... I am in earnest, I will not equivocate, I will not excuse, I will not retreat a single inch, and I will be heard.", "author": "William Lloyd Garrison"},
{"quote":"I'm supposed to have a Ph.D. on the subject of women. But the truth is I've flunked more often than not. I'm very fond of women; I admire them. But, like all men, I don't understand them.", "author": "Frank Sinatra"},
{"quote":"If religion were true, its followers would not try to bludgeon their young into an artificial conformity; but would merely insist on their unbending quest for truth, irrespective of artificial backgrounds or practical consequences.", "author": "H. P. Lovecraft"},
{"quote":"I'm actually a very honest person, and sometimes I end up like, 'Man, I said too much.' It's hard for me not to tell the truth when you ask me.", "author": "Drake"},
{"quote":"Sex is full of lies. The body tries to tell the truth. But, it's usually too battered with rules to be heard, and bound with pretenses so it can hardly move. We cripple ourselves with lies.", "author": "Jim Morrison"},
{"quote":"We all have a social mask, right? We put it on, we go out, put our best foot forward, our best image. But behind that social mask is a personal truth, what we really, really believe about who we are and what we're capable of.", "author": "Phil McGraw"},
{"quote":"Your days are short here; this is the last of your springs. And now in the serenity and quiet of this lovely place, touch the depths of truth, feel the hem of Heaven. You will go away with old, good friends. And don't forget when you leave why you came.", "author": "Adlai E. Stevenson"},
{"quote":"It's in the history books, the Holocaust. It's just a phrase. And the truth is it happened yesterday. It happened to my mother. I never met my grandmothers or my grandfathers. They were all wiped up in the gas chambers of Nazi Germany.", "author": "Gene Simmons"},
{"quote":"A man has to learn that he cannot command things, but that he can command himself; that he cannot coerce the wills of others, but that he can mold and master his own will: and things serve him who serves Truth; people seek guidance of him who is master of himself.", "author": "James Allen"},
{"quote":"One of the reasons people hate politics is that truth is rarely a politician's objective. Election and power are.", "author": "Cal Thomas"},
{"quote":"Great is truth, but still greater, from a practical point of view, is silence about truth. By simply not mentioning certain subjects... totalitarian propagandists have influenced opinion much more effectively than they could have by the most eloquent denunciations.", "author": "Aldous Huxley"},
{"quote":"Art is the lie that enables us to realize the truth.", "author": "Pablo Picasso"},
{"quote":"I trust you: That's huge. That's truth. That's real love. Everyone uses 'I love you' so loosely.", "author": "Justin Chatwin"},
{"quote":"The pursuit of truth and beauty is a sphere of activity in which we are permitted to remain children all our lives.", "author": "Albert Einstein"},
{"quote":"But the attitude of faith is to let go, and become open to truth, whatever it might turn out to be.", "author": "Alan Watts"},
{"quote":"The most powerful element in advertising is the truth.", "author": "William Bernbach"},
{"quote":"We live in an age where there is a firehose of information, and there is no hierarchy of what is important and what is not. Where the truth is often fashioned through a variety of digital means. Are you your avatar? Who are you in social media? What face do you turn toward the world? How much does it have in common with who you actually are?", "author": "David Carr"},
{"quote":"I know that campaigns can seem small, and even silly. Trivial things become big distractions. Serious issues become sound bites. And the truth gets buried under an avalanche of money and advertising. If you're sick of hearing me approve this message, believe me - so am I.", "author": "Barack Obama"},
{"quote":"The theatre was created to tell people the truth about life and the social situation.", "author": "Stella Adler"},
{"quote":"My way of joking is to tell the truth. That's the funniest joke in the world.", "author": "Muhammad Ali"},
{"quote":"Most people think that shadows follow, precede or surround beings or objects. The truth is that they also surround words, ideas, desires, deeds, impulses and memories.", "author": "Elie Wiesel"}
]
}